[
    {
        "species_id": "a4579ff6-cf58-4828-b39e-de99ee4563c4",
        "scientific_name": [
            "achillea_millefolium_hybrids"
        ],
        "common_name": [
            "yarrow",
            "common_yarrow",
            "old_man's_pepper",
            "devil's_nettle",
            "sanguinary",
            "milfoil",
            "soldier's_woundwort",
            "thousand_seal"
        ],
        "resource_links": [
            "https://en.wikipedia.org/wiki/Achillea_millefolium"
        ],
        "species_description": "Achillea millefolium, commonly known as yarrow (/ˈjæroʊ/) or common yarrow, is a flowering plant in the family Asteraceae. Other common names include old man's pepper, devil's nettle, sanguinary, milfoil, soldier's woundwort, and thousand seal.\n\nThe plant is native to temperate regions of the Northern Hemisphere in Asia, Europe, and North America. It has been introduced as a feed for livestock in New Zealand and Australia.",
        "image_links": [
            "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4e/Achillea_millefolium_5Dsr_9042.jpg/220px-Achillea_millefolium_5Dsr_9042.jpg"
        ]
    },
    {
        "species_id": "f4a3d8eb-5dcb-480d-9990-b7c5c6d3c22b",
        "scientific_name": [
            "aconitum"
        ],
        "common_name": [
            "aconite",
            "monkshood",
            "wolfsbane",
            "leopard's_bane",
            "devil's_helmet",
            "blue_rocket"
        ],
        "resource_links": [
            "https://en.wikipedia.org/wiki/Aconitum"
        ],
        "species_description": "Aconitum (/ˌækəˈnaɪtəm/), also known as aconite, monkshood, wolfsbane, leopard's bane, devil's helmet, or blue rocket, is a genus of over 250 species of flowering plants belonging to the family Ranunculaceae. These herbaceous perennial plants are chiefly native to the mountainous parts of the Northern Hemisphere in North America, Europe, and Asia; growing in the moisture-retentive but well-draining soils of mountain meadows.\n\nMost Aconitum species are extremely poisonous and must be handled very carefully. Several Aconitum hybrids, such as the Arendsii form of Aconitum carmichaelii, have won gardening awards—such as the Royal Horticultural Society's Award of Garden Merit. Some are used by florists.",
        "image_links": [
            "https://upload.wikimedia.org/wikipedia/commons/thumb/f/ff/Aconitum_variegatum_110807f.jpg/220px-Aconitum_variegatum_110807f.jpg"
        ]
    },
    {
        "species_id": "506516bd-be4b-4086-9311-909ae711519a",
        "scientific_name": [
            "acorus_calamus"
        ],
        "common_name": [
            "Calamus",
            "Flagroot",
            "Sweet Calamus",
            "Sweet-flag",
            "Sweetroot",
            "Myrtle-flag"
        ],
        "resource_links": [
            "https://en.wikipedia.org/wiki/acorus%20calamus"
        ],
        "species_description": "Acorus calamus (also called sweet flag, sway or muskrat root, among many other common names) is a species of flowering plant with psychoactive chemicals. It is a tall wetland monocot of the family Acoraceae, in the genus Acorus. Although used in traditional medicine over centuries to treat digestive disorders and pain, there is no clinical evidence for its safety or efficacy – and ingested calamus may be toxic – leading to its commercial ban in the United States.",
        "image_links": [
            "https://upload.wikimedia.org/wikipedia/commons/thumb/3/37/Acorus_calamus1.jpg/220px-Acorus_calamus1.jpg"
        ]
    },
    {
        "species_id": "d16c32b9-0b84-4656-846e-208d688992cd",
        "scientific_name": [
            "allium_cernuum"
        ],
        "common_name": [
            "wild_onion",
            "lady's_leek",
            "nodding_onion"
        ],
        "resource_links": [
            "https://en.wikipedia.org/wiki/allium%20cernuum"
        ],
        "species_description": "Allium cernuum, known as nodding onion or lady's leek, is a perennial plant in the genus Allium. It grows in open areas in North America.",
        "image_links": [
            "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4a/Allium_cernuum_1.jpg/220px-Allium_cernuum_1.jpg"
        ]
    },
    {
        "species_id": "e2cc7ed4-0cd8-4caf-a71b-c159c5d4d6c9",
        "scientific_name": [
            "amelanchier_alnifolia"
        ],
        "common_name": [
            "saskatoon_berry",
            "pacific_serviceberry",
            "western_serviceberry",
            "western_shadbush",
            "western_juneberry"
        ],
        "resource_links": [
            "https://en.wikipedia.org/wiki/amelanchier%20alnifolia"
        ],
        "species_description": "Amelanchier alnifolia, the saskatoon berry, Pacific serviceberry, western serviceberry, western shadbush,  or western juneberry, is a shrub with an edible berry-like fruit, native to North America.",
        "image_links": [
            "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b2/Amelanchier_alnifolia_var._semiintegrifolia_4.jpg/220px-Amelanchier_alnifolia_var._semiintegrifolia_4.jpg"
        ]
    },
    {
        "species_id": "862d11ea-d195-433a-acd2-e565cb9a1893",
        "scientific_name": [
            "Amelanchier Arborea"
        ],
        "common_name": [
            "Allegheny Serviceberry",
            "Apple Shadbush",
            "Common Serviceberry",
            "Downy Juneberry",
            "Downy Serviceberry",
            "Downy Shadbush",
            "Juneberry",
            "Shadblow"
        ],
        "resource_links": [
            "https://en.wikipedia.org/wiki/amelanchier%20arborea"
        ],
        "species_description": "Amelanchier arborea (downy serviceberry or common serviceberry), is native to eastern North America from the Gulf Coast north to Thunder Bay in Ontario and Lake St. John in Quebec, and west to Texas and Minnesota.Other common names are \"shadberries\" (as their blossoming coincides with the shad runs in New England), \"Juneberries\" (because the berries usually set on in June), and \"Service\" or \"Sarvice\" berries because their blooms mean that the muddy back roads into the \"coves and hollers\" of Appalachia will soon be passable for circuit-riding preachers and the communities will be able to have Sunday services again. (Some say, more morbidly, that it means the ground is soft enough to dig, which means that those who died over winter can be buried and have services said over them.)Amelanchier arborea is generally 5–12 m (16–39 ft) tall. Occasionally, it can grow up to 20 metres (66 ft) tall and reach into the overstory. The trunk can be up to 15 cm (6 in) in diameter (rarely to 40 cm or 16 in). The bark is smooth and gray.The buds are slender with a pointed tip, and usually more than two scales visible. The leaves are ovate or elliptical, 4–8 cm (1+1⁄2–3+1⁄4 in), rarely 10 cm (4 in), long and 2.5–4 cm (1–1+5⁄8 in) wide, with pointed tips and finely serrated margins. A characteristic useful for identification is that the young leaves emerge downy on the underside. The fall color is variable, from orange-yellow to pinkish or reddish.It has perfect flowers that are 15–25 mm (5⁄8–1 in) in diameter, with 5 petals, emerging during budbreak in early spring. The petals are white. Flowers are produced on pendulous racemes 3–5 cm (1+1⁄4–2 in) long with 4–10 flowers on each raceme. The flowers are pollinated by bees. The fruit is a reddish-purple pome, resembling a small apple in shape. They ripen in summer and are very popular with birds. The fruit is eaten by over 40 species of birds and various mammals, including squirrels, rabbits, chipmunks, mice, voles, foxes,  black bears, deer, and elk.It also commonly hybridizes with other species of Amelanchier, the hybrid Amelanchier × grandiflora being one example, and identification can be very difficult as a result.",
        "image_links": [
            "https://upload.wikimedia.org/wikipedia/commons/thumb/3/34/Amelanchier_arborea_leaves.JPG/220px-Amelanchier_arborea_leaves.JPG"
        ]
    },
    {
        "species_id": "13bf94e3-9677-4bcb-b363-7c7f2b1f53c7",
        "scientific_name": [
            "amelanchier_canadensis"
        ],
        "common_name": [
            "Canadian serviceberry"
        ],
        "resource_links": [
            "https://en.wikipedia.org/wiki/amelanchier%20canadensis"
        ],
        "species_description": "Amelanchier canadensis (bilberry, Canadian serviceberry, chuckle-berry, currant-tree, juneberry, shad-blow serviceberry, shad-blow, shadbush, shadbush serviceberry, sugarplum, thicket serviceberry) is a species of Amelanchier native to eastern North America in Canada from Newfoundland west to southern Ontario, and in the United States from Maine south to Alabama. It is largely restricted to wet sites, particularly on the Atlantic coastal plain, growing at altitudes from sea level up to 200 m.",
        "image_links": [
            "https://upload.wikimedia.org/wikipedia/commons/thumb/2/28/Amelanchier_canadensis_flower.jpg/220px-Amelanchier_canadensis_flower.jpg",
            "https://upload.wikimedia.org/wikipedia/commons/thumb/2/29/Amelanchier_canadensis_berry.jpg/220px-Amelanchier_canadensis_berry.jpg"
        ]
    },
    {
        "species_id": "f9bbb270-1b05-4878-8d20-cccb33fa835a",
        "scientific_name": [
            "amelanchier_laevis"
        ],
        "common_name": [
            "allegheny_serviceberry"
        ],
        "resource_links": [
            "https://en.wikipedia.org/wiki/amelanchier%20laevis"
        ],
        "species_description": "Amelanchier laevis, the smooth shadbush, smooth serviceberry or Allegheny serviceberry, is a North American species of tree in the rose family Rosaceae, growing up to 9 metres (30 ft) tall. It is native to eastern Canada and the eastern United States, from Newfoundland west to Ontario, Minnesota, and Iowa, south as far as Georgia and Alabama.",
        "image_links": [
            "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d0/Amelanchier_laevis.jpg/220px-Amelanchier_laevis.jpg"
        ]
    },
    {
        "species_id": "cd5de2d1-b564-4a04-a6e6-9ea045534907",
        "scientific_name": [
            "anaphalis_margaritacea"
        ],
        "common_name": [
            "western_pearly_everlasting",
            "pearly_everlasting"
        ],
        "resource_links": [
            "https://en.wikipedia.org/wiki/anaphalis%20margaritacea"
        ],
        "species_description": "Anaphalis margaritacea, commonly known as the western pearly everlasting or pearly everlasting, is an Asian and North American species of flowering perennial plant in the family Asteraceae.",
        "image_links": [
            "https://upload.wikimedia.org/wikipedia/commons/thumb/3/32/Anapahlis_margaritacea.jpg/220px-Anapahlis_margaritacea.jpg"
        ]
    },
    {
        "species_id": "d9def077-d14a-4d56-b345-f7b2561c050b",
        "scientific_name": [
            "antirrhinum_majus"
        ],
        "common_name": [
            "Snapdragon"
        ],
        "resource_links": [
            "https://en.wikipedia.org/wiki/antirrhinum%20majus"
        ],
        "species_description": "Antirrhinum majus, the common snapdragon (often - especially in horticulture - simply \"snapdragon\"), is a species of flowering plant belonging to the genus Antirrhinum. The plant was placed in the family Plantaginaceae following a revision of its prior classical family, Scrophulariaceae.The common name \"snapdragon\", originates from the flowers' reaction to having their throats squeezed, which causes the \"mouth\" of the flower to snap open like a dragon's mouth. It is widely used as an ornamental plant in borders and as a cut flower. It is perennial but usually cultivated as an annual plant. The species has been in culture since the 15th century.",
        "image_links": [
            "https://upload.wikimedia.org/wikipedia/commons/thumb/6/66/Antirrhinum_majus_from_Thasos.JPG/220px-Antirrhinum_majus_from_Thasos.JPG"
        ]
    },
    {
        "species_id": "129368bc-8ed0-49ef-9807-deaba857c919",
        "scientific_name": [
            "aquilegia_formosa"
        ],
        "common_name": [
            "Western Columbine"
        ],
        "resource_links": [
            "https://en.wikipedia.org/wiki/aquilegia%20formosa"
        ],
        "species_description": "Aquilegia formosa, the crimson columbine, western columbine, or (ambiguously) \"red columbine\", is a common wildflower native to western North America, from Alaska to Baja California, and eastward to Montana and Wyoming.",
        "image_links": [
            "https://upload.wikimedia.org/wikipedia/commons/thumb/1/10/Aquilegia_formosa_6742.JPG/220px-Aquilegia_formosa_6742.JPG"
        ]
    },
    {
        "species_id": "c3bb9e6b-7382-4c21-9a4d-0bf6a34b3281",
        "scientific_name": [
            "arctostaphylos_uva-ursi"
        ],
        "common_name": [
            "bearberry"
        ],
        "resource_links": [
            "https://en.wikipedia.org/wiki/arctostaphylos%20uva-ursi"
        ],
        "species_description": "Arctostaphylos uva-ursi is a plant species of the genus Arctostaphylos widely distributed across circumboreal regions of the subarctic Northern Hemisphere. Kinnikinnick (from the Unami for \"smoking mixture\") is a common name in Canada and the United States. Growing up to 30 centimetres (12 inches) in height, the leaves are evergreen. The flowers are white to pink and the fruit is a red berry.One of several related species referred to as bearberry, its specific epithet uva-ursi means \"grape of the bear\" in Latin (), similar to the meaning of the generic epithet Arctostaphylos (Greek for \"bear grapes\").",
        "image_links": [
            "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d8/Arctostaphylos_uva-ursi_25924.JPG/220px-Arctostaphylos_uva-ursi_25924.JPG"
        ]
    },
    {
        "species_id": "993a5e83-7353-4181-9b5b-e0da378f7408",
        "scientific_name": [
            "arnica_spp."
        ],
        "common_name": [
            "mountain_tobacco",
            "leopard's_bane",
            "wolfsbane"
        ],
        "resource_links": [
            "https://en.wikipedia.org/wiki/Arnica"
        ],
        "species_description": "Arnica /ˈɑːrnɪkə/ is a genus of perennial, herbaceous plants in the sunflower family (Asteraceae). The genus name Arnica may be derived from the Greek arni, \"lamb\", in reference to the plants' soft, hairy leaves. Arnica is also known by the names mountain tobacco and confusingly, leopard's bane and wolfsbane—two names that it shares with the entirely unrelated genus Aconitum.\n\nThis circumboreal and montane (subalpine) genus occurs mostly in the temperate regions of western North America, with a few species native to the Arctic regions of northern Eurasia and North America.\n\nArnica species are used as food plants by the larvae of some Lepidoptera species, including Bucculatrix arnicella.\n\nArnica was previously classified in the tribe Senecioneae because it has a flower or pappus of fine bristles.",
        "image_links": [
            "https://upload.wikimedia.org/wikipedia/commons/thumb/7/7f/Arnica_chamissonis0.jpg/440px-Arnica_chamissonis0.jpg",
            "https://upload.wikimedia.org/wikipedia/commons/thumb/1/17/Arnica_montana_-_K%C3%B6hler%E2%80%93s_Medizinal-Pflanzen-015.jpg/440px-Arnica_montana_-_K%C3%B6hler%E2%80%93s_Medizinal-Pflanzen-015.jpg"
        ]
    },
    {
        "species_id": "fe24ac85-28cc-45e9-b012-f08fdfad41c4",
        "scientific_name": [
            "aruncus_dioicus"
        ],
        "common_name": [
            "bride's feathers"
        ],
        "resource_links": [
            "https://en.wikipedia.org/wiki/aruncus%20dioicus"
        ],
        "species_description": "Aruncus dioicus, known as goat's beard, buck's-beard or bride's feathers, is a flowering herbaceous perennial plant in the family Rosaceae, found in Europe, Asia, and eastern and western North America. It is the type species of the genus Aruncus. It has alternate, pinnately compound leaves, on thin, stiff stems, with plumes of feathery white or cream flowers borne in summer.The Latin specific epithet dioicus means \"having the male reproductive organs on one plant, and the female on another\".",
        "image_links": [
            "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e4/Aruncus_dioicus_1549.JPG/220px-Aruncus_dioicus_1549.JPG"
        ]
    },
    {
        "species_id": "4cd3e9db-6472-4248-a669-28211f48957b",
        "scientific_name": [
            "asarum_caudatum"
        ],
        "common_name": [
            "British Columbia Wild Ginger",
            "Long-tailed Wild Ginger",
            "Western Wild Ginger",
            "Wild Ginger"
        ],
        "resource_links": [
            "https://en.wikipedia.org/wiki/asarum%20caudatum"
        ],
        "species_description": "Asarum caudatum (British Columbia wild ginger, western wild ginger, or long-tailed wild ginger) is a plant native to rich moist forests of western North America. It has heart-shaped leaves and a three-lobed purplish flower.",
        "image_links": [
            "https://upload.wikimedia.org/wikipedia/commons/thumb/6/6d/Asarum_caudatum_10993.JPG/220px-Asarum_caudatum_10993.JPG"
        ]
    },
    {
        "species_id": "5e1b668d-5f0f-4f52-8ddb-225c307c69f0",
        "scientific_name": [
            "asclepias_incarnata"
        ],
        "common_name": [
            "Pleurisy Root",
            "Swamp Milkweed",
            "Pleurisy Root",
            "Swamp Milkweed",
            "Pleurisy Root",
            "Swamp Milkweed",
            "swamp milkweed",
            "swamp milkweed"
        ],
        "resource_links": [
            "https://en.wikipedia.org/wiki/asclepias%20incarnata"
        ],
        "species_description": "Asclepias incarnata, the swamp milkweed, rose milkweed, rose milkflower, swamp silkweed, or white Indian hemp,  is a herbaceous perennial plant species native to North America. It grows in damp through wet soils and also is cultivated as a garden plant for its flowers, which attract butterflies and other pollinators with nectar.  Like most other milkweeds, it has latex containing toxic chemicals, a characteristic that repels insects and other herbivorous animals.",
        "image_links": [
            "https://upload.wikimedia.org/wikipedia/commons/thumb/2/21/Swamp_milkweed_monarch.jpg/220px-Swamp_milkweed_monarch.jpg"
        ]
    },
    {
        "species_id": "2a40e80b-083d-41aa-850f-6d5f43ef3bb4",
        "scientific_name": [
            "astilbe_x_arendsii"
        ],
        "common_name": [
            "false_spirea"
        ],
        "resource_links": [
            "https://en.wikipedia.org/wiki/astilbe%20x%20arendsii"
        ],
        "species_description": "Astilbe Arendsii Group (Astilbe × arendsii) is a cultivar group of complex hybrids with A. astilboides, A. chinensis, A. japonica, A. thunbergii and others. They are all perennial, herbaceous plants with flowers in various shades from white to purplish red.Numerous cultivars exist, a majority of them produced by breeders in Germany and Holland. The name is derived from the surname of German horticulturist Georg Arends who was responsible for nearly all hybrid cultivars sold in North America.Invalid names:",
        "image_links": [
            "https://upload.wikimedia.org/wikipedia/commons/thumb/b/bb/AstilbeArendsiiGroupWeisseGloria1UME.jpg/220px-AstilbeArendsiiGroupWeisseGloria1UME.jpg"
        ]
    },
    {
        "species_id": "c9baed93-4ed3-406d-a375-d62a033ace6a",
        "scientific_name": [
            "aurinia_saxatilis"
        ],
        "common_name": [
            "basket_of_gold",
            "goldentuft_alyssum",
            "golden_alyssum",
            "golden_alison",
            "gold-dust",
            "golden-tuft_alyssum",
            "golden-tuft_madwort",
            "rock_madwort"
        ],
        "resource_links": [
            "https://en.wikipedia.org/wiki/aurinia%20saxatilis"
        ],
        "species_description": "Aurinia saxatilis (syns Alyssum saxatile, Alyssum saxatile var. compactum) is an ornamental plant native to Asia and Europe.\n\nThis is a little, rounded, evergreen perennial that can grow from 4 to 12in high, forming a mound up to 16-20in across. The flowers are clear yellow, but the various cultivars produce flowers in white, cream, lemon, peach or gold.",
        "image_links": [
            "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f3/Aurinia_saxatilis_TK_2021-04-22_4.jpg/220px-Aurinia_saxatilis_TK_2021-04-22_4.jpg"
        ]
    },
    {
        "species_id": "36840d05-a6b9-4123-93bd-1db282f045bf",
        "scientific_name": [
            "berberis_aquifolium"
        ],
        "common_name": [
            "Oregon-grape",
            "hollyleaved barberry"
        ],
        "resource_links": [
            "https://en.wikipedia.org/wiki/berberis%20aquifolium"
        ],
        "species_description": "Berberis aquifolium, the Oregon grape or holly-leaved barberry, is a species of flowering plant in the family Berberidaceae, native to western North America. It is an evergreen shrub growing 1–3 meters (3–10 feet) tall and 1.5 m (5 ft) wide, with pinnate leaves consisting of spiny leaflets, and dense clusters of yellow flowers in early spring, followed by dark bluish-black berries.The berries are included in the diet of some aboriginal peoples of the Pacific Northwest, and the species is recognized as the state flower of Oregon.",
        "image_links": [
            "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8e/Mahonia_aquifolium.jpg/220px-Mahonia_aquifolium.jpg"
        ]
    },
    {
        "species_id": "18fb8c63-263f-4aa8-ab7d-9702f6da8c0d",
        "scientific_name": [
            "berberis_nervosa"
        ],
        "common_name": [
            "longleaf holly-grape",
            "water-holly",
            "Oregon barberry",
            "Oregon grape-holly",
            "Oregon-grape"
        ],
        "resource_links": [
            "https://en.wikipedia.org/wiki/berberis%20nervosa"
        ],
        "species_description": "Berberis nervosa, commonly known as dwarf Oregon-grape, Cascade barberry, Cascade Oregon-grape, or dull Oregon-grape, is a flowering plant native to the northwest coast of North America from southern British Columbia south to central California, with an isolated population inland in northern Idaho. It is especially common in second growth, Douglas-fir or western redcedar forests, making use of those pools of sunlight that intermittently reach the ground.The plant was collected by Lewis and Clark during their famous expedition to the West before being described for western science by Frederick T. Pursh in 1813.",
        "image_links": [
            "https://upload.wikimedia.org/wikipedia/commons/thumb/1/1d/Mahonia_nervosa_-_Oregon_grape.jpg/220px-Mahonia_nervosa_-_Oregon_grape.jpg"
        ]
    },
    {
        "species_id": "8c79bb90-1824-4adc-9e75-3f5977aaeec9",
        "scientific_name": [
            "blechnum_spicant"
        ],
        "common_name": [
            "hard_fern"
        ],
        "resource_links": [
            "https://en.wikipedia.org/wiki/blechnum%20spicant"
        ],
        "species_description": "Struthiopteris spicant, syn. Blechnum spicant, is a species of fern in the family Blechnaceae, known by the common names hard-fern or deer fern.  It is native to Europe, western Asia, northern Africa, and western North America. Like some other species in the family Blechnaceae, it has two types of leaves. The sterile leaves have flat, wavy-margined leaflets 5 to 8 millimeters wide, while the fertile leaves have much narrower leaflets, each with two thick rows of sori on the underside.The Latin specific epithet spicant is of uncertain origin, possibly referring to a tufted or spiky habit.S. spicant is hardy down to −20 °C (−4 °F) and evergreen, growing to 0.5 m (1 ft 8 in). It has gained the Royal Horticultural Society's Award of Garden Merit.The species was first described in 1753 by Carl Linnaeus as Osmunda spicant. It has been placed in a wide range of genera, including Blechnum (as Blechnum spicant). In the Pteridophyte Phylogeny Group classification of 2016 (PPG I), it is placed in the genus Struthiopteris, in the subfamily Blechnoideae.A sterile leafA fertile leaf with sori",
        "image_links": [
            "https://upload.wikimedia.org/wikipedia/commons/thumb/1/1e/Blechnum_spicant_%28fertile_and_sterile_fronts%29.jpg/220px-Blechnum_spicant_%28fertile_and_sterile_fronts%29.jpg"
        ]
    },
    {
        "species_id": "fdc363a8-f988-4811-beda-883e083f77fd",
        "scientific_name": [
            "caltha_palustris"
        ],
        "common_name": [
            "marsh-marigold",
            "giant_kingcup",
            "marsh_marigold",
            "marsh_marigold",
            "marsh_marigold",
            "american_cowslip",
            "common_marsh_marigold",
            "cowflock",
            "cowslip",
            "giant_kingcup",
            "kingcup",
            "marsh_marigold",
            "marsh-marigold",
            "mayblob",
            "meadow-bright",
            "yellow_elkslip",
            "yellow_marsh_marigold",
            "american_cowslip",
            "common_marsh_marigold",
            "cowflock",
            "cowslip",
            "kingcup",
            "marsh_marigold",
            "mayblob",
            "yellow_elkslip",
            "yellow_marsh_marigold",
            "cowflock",
            "cowslip",
            "marsh-marigold",
            "meadow-bright",
            "kingcup"
        ],
        "resource_links": [
            "https://en.wikipedia.org/wiki/caltha%20palustris"
        ],
        "species_description": "Caltha palustris, known as marsh-marigold and kingcup, is a small to medium size perennial herbaceous plant of the buttercup family, native to marshes, fens, ditches and wet woodland in temperate regions of the Northern Hemisphere. It flowers between April and August, dependent on altitude and latitude, but occasional flowers may occur at other times.",
        "image_links": [
            "https://upload.wikimedia.org/wikipedia/commons/thumb/5/5d/Caltha_palustris_plant.JPG/220px-Caltha_palustris_plant.JPG"
        ]
    },
    {
        "species_id": "ff573030-058b-469b-b723-6aa17a5b9719",
        "scientific_name": [
            "campanula_glomerata"
        ],
        "common_name": [
            "clustered_bellflower"
        ],
        "resource_links": [
            "https://en.wikipedia.org/wiki/campanula%20glomerata"
        ],
        "species_description": "Campanula glomerata, known by the common names clustered bellflower or Dane's blood, is a species of flowering plant in the genus Campanula, belonging to the family Campanulaceae. It is the county flower of Rutland, England.",
        "image_links": [
            "https://upload.wikimedia.org/wikipedia/commons/thumb/7/7f/Campanula_glomerata.JPG/220px-Campanula_glomerata.JPG"
        ]
    },
    {
        "species_id": "ca32fc82-ae37-46bd-9477-16888087019e",
        "scientific_name": [
            "campanula_rotundifolia"
        ],
        "common_name": [
            "harebell",
            "scottish_bluebell"
        ],
        "resource_links": [
            "https://en.wikipedia.org/wiki/campanula%20rotundifolia"
        ],
        "species_description": "Campanula rotundifolia, the harebell, Scottish bluebell, or bluebell of Scotland, is a species of flowering plant in the bellflower family Campanulaceae. This herbaceous perennial is found throughout the temperate regions of the northern hemisphere. In Scotland, it is often known simply as bluebell. It is the floral emblem of Sweden where it is known as small bluebell. It produces its violet-blue, bell-shaped flowers in late summer and autumn.The Latin specific epithet rotundifolia means \"round leaved\". However, not all leaves are round in shape. Middle stem-leaves are linear.: 707",
        "image_links": [
            "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4b/Campanula_rotondifolia.jpg/220px-Campanula_rotondifolia.jpg"
        ]
    },
    {
        "species_id": "e76634a9-2896-4c12-a31f-1f0ffa06f92b",
        "scientific_name": [
            "carex_oshimensis_‘evergold’"
        ],
        "common_name": [
            "evergold_sedge"
        ],
        "resource_links": [
            "https://bcinvasives.ca/play-your-part/plantwise/grow-me-instead/evergold-sedge/"
        ],
        "species_description": "Evergold sedge is an evergreen grass with attractive green and pale yellow variegated blades. This clump-forming plant has a graceful, arching habit and does well in the shade. Evergold sedge is tolerant of moist to dry soils and looks great in a mass planting or container.\n\nWhen selecting non-invasive plants for your garden, be sure to look for those that are suitable for your location, including moisture requirements, hardiness zone, and avoidance of known bear attractants among other factors.",
        "image_links": [
            "https://bcinvasives.ca/wp-content/uploads/2021/05/Evergold-Sedge_Carex-oshimensis-Evergold_Dreamstime-800x533.jpg"
        ]
    },
    {
        "species_id": "b8b1a086-4cb6-400f-ad78-a3a3a2e3ca24",
        "scientific_name": [
            "ceanothus_spp._and_hybrids"
        ],
        "common_name": [
            "california_lilac"
        ],
        "resource_links": [
            "https://bcinvasives.ca/play-your-part/plantwise/grow-me-instead/california-lilac/#:~:text=About%20This%20Species&text=California%20lilac%20is%20a%20sturdy,butterflies%2C%20bees%2C%20and%20hummingbirds."
        ],
        "species_description": "California lilac is a sturdy shrub growing to 5 m tall. It has glossy, leathery, evergreen leaves, and fragrant violet flowers that bloom from mid-spring to early winter. The flowers are very attractive to butterflies, bees, and hummingbirds. This shrub tolerates being pruned as a hedge and does well in sunny and dry soils. One important note about California lilac is that it does not tolerate “wet feet” – so ensure your lilac is planted in a well-draining spot. It is very drought tolerant once it has become established. California lilac is a nitrogen-fixer, which makes it an excellent choice for permaculture gardens.\n\nWhen selecting non-invasive plants for your garden, be sure to look for those that are suitable for your location, including moisture requirements, hardiness zone, and avoidance of known bear attractants among other factors.",
        "image_links": [
            "https://encrypted-tbn1.gstatic.com/licensed-image?q=tbn:ANd9GcSsUvPz-3EhlNYc5R-KP0saA1nhRGoWvPDSvH6RQi4hDtadRjjeEsuadpHa4P8TjgS-A1ScLGemWZsXkrU",
            "https://bcinvasives.ca/wp-content/uploads/2021/05/California-Lilac_Ceanothus-sp._J-Ruter_University-of-Georgia_Bugwood.org_-1170x780.jpg"
        ]
    },
    {
        "species_id": "a2117bf1-bd39-4558-ad33-7c26f006982b",
        "scientific_name": [
            "cerastium_tomentosum"
        ],
        "common_name": [
            "Snow-in-summer"
        ],
        "resource_links": [
            "https://en.wikipedia.org/wiki/cerastium%20tomentosum"
        ],
        "species_description": "Cerastium tomentosum (snow-in-summer) is an herbaceous flowering plant and a member of the family Caryophyllaceae. It is generally distinguished from other species of its genus by \"tomentose\" or felty foliage. It is a low, spreading perennial native to alpine regions of Europe. The stems & leaves are silvery-grey, whilst the flowers are star-like, white & about 15mm across.",
        "image_links": [
            "https://upload.wikimedia.org/wikipedia/commons/thumb/6/62/Cerastium_tomentosum.jpg/220px-Cerastium_tomentosum.jpg"
        ]
    },
    {
        "species_id": "fd2d252e-2f0b-4b3c-beb1-8a8257a73a84",
        "scientific_name": [
            "ceratophyllum_demersum"
        ],
        "common_name": [
            "common coontail",
            "common hornwort",
            "coon's-tail",
            "coontail",
            "hornwort"
        ],
        "resource_links": [
            "https://en.wikipedia.org/wiki/ceratophyllum%20demersum"
        ],
        "species_description": "Ceratophyllum demersum, commonly known as hornwort, rigid hornwort, coontail, or coon's tail, is a species of Ceratophyllum. It is a submerged, free-floating aquatic plant, with a cosmopolitan distribution, native to all continents except Antarctica. It is a harmful weed introduced in New Zealand. It is also a popular aquarium plant.",
        "image_links": [
            "https://upload.wikimedia.org/wikipedia/commons/thumb/0/05/Ceratophyllum_demersum.jpg/220px-Ceratophyllum_demersum.jpg"
        ]
    },
    {
        "species_id": "0e8ab925-a6bd-4975-baa0-5ffb5ee99819",
        "scientific_name": [
            "chelone_glabra"
        ],
        "common_name": [
            "white_turtlehead_or_balmony"
        ],
        "resource_links": [
            "https://en.wikipedia.org/wiki/chelone%20glabra"
        ],
        "species_description": "Chelone glabra, or white turtlehead, is a herbaceous species of plant native to North America. Its native range extends from Georgia to Newfoundland and Labrador and from Mississippi to Manitoba. Its common name comes from the appearance of its flower petals, which resemble the head of a tortoise. In fact, in Greek, chelone means \"tortoise\" and was the name of a nymph who refused to attend the wedding of Zeus and was turned into a turtle as punishment. Its natural habitat is wet areas, such as riparian forests and swamps.Its classification at the family level has in the past been controversial, but as a result of DNA sequence studies, it is now regarded as belonging to family Plantaginaceae (the plantain family). In early taxonomic treatments the species was divided into a number of subspecific categories but more recent studies indicate no morphological or genetic basis for these taxonomic categories.",
        "image_links": [
            "https://upload.wikimedia.org/wikipedia/commons/thumb/1/1c/Chelone_glabra_Red_River_Gorge.JPG/220px-Chelone_glabra_Red_River_Gorge.JPG"
        ]
    },
    {
        "species_id": "779f546f-ef42-43ce-b2da-50666ff8900d",
        "scientific_name": [
            "chelone_lyonii,_c._oblique"
        ],
        "common_name": [
            "pink_turtle"
        ],
        "resource_links": [
            "https://bcinvasives.ca/play-your-part/plantwise/grow-me-instead/pink-turtle/"
        ],
        "species_description": "Pink turtle is a clump-forming perennial with deep green leaves and pink flowers that resemble turtle heads. This plant enjoys moist soils and is very attractive to butterflies and hummingbirds.\n\nWhen selecting non-invasive plants for your garden, be sure to look for those that are suitable for your location, including moisture requirements, hardiness zone, and avoidance of known bear attractants among other factors.",
        "image_links": [
            "https://bcinvasives.ca/wp-content/uploads/2021/05/Pink-Turtle_Chelone-lyonii_K-Rawlins_University-of-Georgia_Bugwood.org_-1170x778.jpg"
        ]
    },
    {
        "species_id": "f24858da-a938-4d4b-a65b-85414bea77ec",
        "scientific_name": [
            "clinopodium_douglasii"
        ],
        "common_name": [
            "Douglas' calamint",
            "Oregon tea",
            "yerba buena"
        ],
        "resource_links": [
            "https://en.wikipedia.org/wiki/clinopodium%20douglasii"
        ],
        "species_description": "Micromeria douglasii, synonym Clinopodium douglasii, or yerba buena, is a rambling aromatic herb of western and northwestern North America, ranging from maritime Alaska southwards to California. The plant takes the form of a sprawling, mat-forming perennial, and is especially abundant close to the coast.  The name \"yerba buena\" derives from Spanish for \"good herb\" and is applied to various other plants. In 2010, molecular evidence placed the species within the Clinopodium complex rather than Micromeria.Leaves and flowersFlower close-up",
        "image_links": [
            "https://upload.wikimedia.org/wikipedia/commons/thumb/7/76/Yerba_Buena_-_Clinopodium_douglasii.jpg/220px-Yerba_Buena_-_Clinopodium_douglasii.jpg"
        ]
    },
    {
        "species_id": "ef2b86e6-72c8-4b71-9dd3-e937e16f3a6c",
        "scientific_name": [
            "cornus_canadensis"
        ],
        "common_name": [
            "_canadian_dwarf_cornel",
            "canadian_bunchberry",
            "quatre-temps",
            "crackerberry",
            "creeping_dogwood"
        ],
        "resource_links": [
            "https://en.wikipedia.org/wiki/cornus%20canadensis"
        ],
        "species_description": "Cornus canadensis is a species of flowering plant in the dogwood family Cornaceae, native to eastern Asia and North America. Common names include Canadian dwarf cornel, Canadian bunchberry, quatre-temps, crackerberry, and creeping dogwood. Unlike its relatives, which are for the most part substantial trees and shrubs, C. canadensis is a creeping, rhizomatous perennial growing to about 20 centimetres (8 inches) tall.",
        "image_links": [
            "https://upload.wikimedia.org/wikipedia/commons/thumb/0/0b/CanadianDogwoodGrowingTrailSide_cropped.jpg/220px-CanadianDogwoodGrowingTrailSide_cropped.jpg"
        ]
    },
    {
        "species_id": "6252a1ef-2c83-42c5-9ff5-a1cffce32029",
        "scientific_name": [
            "cornus_stolonifera"
        ],
        "common_name": [
            "red-osier_dogwood"
        ],
        "resource_links": [
            "https://en.wikipedia.org/wiki/cornus%20stolonifera"
        ],
        "species_description": "Cornus sericea, the red osier or red-osier dogwood, is a species of flowering plant in the family Cornaceae, native to much of North America. It has sometimes been considered a synonym of the Asian species Cornus alba. Other names include red brush, red willow, redstem dogwood, redtwig dogwood, red-rood, American dogwood, creek dogwood, and western dogwood.",
        "image_links": [
            "https://upload.wikimedia.org/wikipedia/commons/thumb/5/56/Red_Osier_Dogwood.jpg/220px-Red_Osier_Dogwood.jpg"
        ]
    },
    {
        "species_id": "f675d1b8-d58f-4e92-a4fe-65a4a7a95ed0",
        "scientific_name": [
            "cotinus_coggygria"
        ],
        "common_name": [
            "European smoketree"
        ],
        "resource_links": [
            "https://en.wikipedia.org/wiki/cotinus%20coggygria"
        ],
        "species_description": "Cotinus coggygria, syn. Rhus cotinus, the European smoketree, Eurasian smoketree, smoke tree, smoke bush, Venetian sumach, or dyer's sumach, is a Eurasian species of flowering plant in the family Anacardiaceae.",
        "image_links": [
            "https://upload.wikimedia.org/wikipedia/commons/thumb/7/75/Cotinus_coggygria5.jpg/220px-Cotinus_coggygria5.jpg"
        ]
    },
    {
        "species_id": "2aac96d0-8f3e-4026-9b68-93365bd63e66",
        "scientific_name": [
            "cotoneaster_dammeri_‘lowfast’"
        ],
        "common_name": [
            "lowfast_cotoneaster"
        ],
        "resource_links": [
            "https://bcinvasives.ca/play-your-part/plantwise/grow-me-instead/lowfast-cotoneaster/"
        ],
        "species_description": "This species is a low-growing, woody, evergreen shrub with small, leathery, rounded, green leaves. The leaves turn reddish-bronze or purple in the winter. It produces pretty white flowers in late spring to early summer. They are replaced by bright red berries in the fall which attract birds and mammals. This woody, mat-forming, groundcover plant requires full sun to partial shade, moist, well-drained soils.\n\nWhen selecting non-invasive plants for your garden, be sure to look for those that are suitable for your location, including moisture requirements, hardiness zone, and avoidance of known bear attractants among other factors.",
        "image_links": [
            "https://bcinvasives.ca/wp-content/uploads/2021/05/Cotoneaster_Cotoneaster-dammeri_J-Ruter_University-of-Georgia_Bugwood.org_-1170x780.jpg"
        ]
    },
    {
        "species_id": "f81f40a0-dc59-4400-8ae0-69e454e48bb3",
        "scientific_name": [
            "daphne_odora"
        ],
        "common_name": [
            "winter daphne"
        ],
        "resource_links": [
            "https://en.wikipedia.org/wiki/daphne%20odora"
        ],
        "species_description": "Daphne odora, winter daphne, is a species of flowering plant in the family Thymelaeaceae, native to China, later spread to Japan and Korea. It is an evergreen shrub, grown for its very fragrant, fleshy, pale-pink, tubular flowers, each with four spreading lobes, and for its glossy foliage. It rarely fruits, producing red berries after flowering.The Latin specific epithet odora means \"fragrant\".It grows best in fertile, slightly acid, peaty, well-drained soils. It grows in full sun or partial shade, and is hardy to −10 °C (14 °F), possibly lower. In Korea, the plant is also poetically called \"chullihyang\" – a thousand-mile scent – referring to the fragrance of the foliage. In Japan, the plant is more commonly known as \"jinchōge\".Plants are not long lived, usually lasting eight to ten years. Daphne generally do not react well to root disturbance, and may transplant badly. D. odora is also susceptible to virus infection, which causes leaf mottling.All parts of the plant are poisonous to humans and a range of domestic animals and some people experience dermatitis from contact with the sap.Daphne odora is propagated by semi-ripe cuttings in summer.",
        "image_links": [
            "https://upload.wikimedia.org/wikipedia/commons/thumb/9/9f/Daphne_odora-ja01.jpg/220px-Daphne_odora-ja01.jpg"
        ]
    },
    {
        "species_id": "7050697f-3039-480d-8c42-9eb96f3db4fd",
        "scientific_name": [
            "delosperma_nubigenum"
        ],
        "common_name": [
            "yellow_ice_plant"
        ],
        "resource_links": [
            "https://bcinvasives.ca/play-your-part/plantwise/grow-me-instead/yellow-ice-plant/"
        ],
        "species_description": "Yellow ice plant is a hardy, evergreen succulent that flowers profusely all summer long. Must have a well-draining, hot sunny site to thrive. In the fall and winter foliage turns orange – must not be exposed to standing water throughout the winter months.\n\nWhen selecting non-invasive plants for your garden, be sure to look for those that are suitable for your location, including moisture requirements, hardiness zone, and avoidance of known bear attractants among other factors.",
        "image_links": [
            "https://www.gardenia.net/wp-content/uploads/2023/05/delosperma-nubigenum-780x520.webp",
            "https://bcinvasives.ca/wp-content/uploads/2021/05/Yellow-Ice-Plant_Delosperma-nubigenum_A-McCabe_ISCBC-Staff-800x533.jpg"
        ]
    },
    {
        "species_id": "be5e7780-c00a-4931-bbe2-b245b19cd886",
        "scientific_name": [
            "delphinium_hybrids"
        ],
        "common_name": [
            "larkspur"
        ],
        "resource_links": [
            "https://bcinvasives.ca/play-your-part/plantwise/grow-me-instead/larkspur/"
        ],
        "species_description": "Larkspurs are fantastic garden perennials. Growing to 2 m tall, these beautiful plants bloom in the summer with showy spikes of pink, purple, blue, or white flowers above ferny foliage. Larkspurs require consistently moist soils and full sun to thrive. These plants are very toxic however so take care to not grow them where children or pets can access them.\n\nWhen selecting non-invasive plants for your garden, be sure to look for those that are suitable for your location, including moisture requirements, hardiness zone, and avoidance of known bear attractants among other factors.",
        "image_links": [
            "https://upload.wikimedia.org/wikipedia/commons/thumb/7/76/Delphinium.jpg/280px-Delphinium.jpg",
            "https://bcinvasives.ca/wp-content/uploads/2021/05/Larkspur_Delphium-hybrid_RD-Wallace_University-of-Georgia_Bugwood.org_-1-800x533.jpg"
        ]
    },
    {
        "species_id": "3826b1a8-4730-4387-b039-012e164a7c7e",
        "scientific_name": [
            "dicentra_formosa"
        ],
        "common_name": [
            "pacific_bleeding-heart",
            "bleeding-heart"
        ],
        "resource_links": [
            "https://en.wikipedia.org/wiki/dicentra%20formosa"
        ],
        "species_description": "Dicentra formosa (western, wild or Pacific bleeding heart) is a flowering plant with fern-like leaves and an inflorescence of drooping pink, purple, yellow or cream flowers native to the Pacific Coast of North America.",
        "image_links": [
            "https://upload.wikimedia.org/wikipedia/commons/thumb/7/76/Dicentra_formosa_6897.JPG/220px-Dicentra_formosa_6897.JPG"
        ]
    },
    {
        "species_id": "41f42b3d-8da5-446a-8d05-c8aa9ed52131",
        "scientific_name": [
            "echinacea_purpurea"
        ],
        "common_name": [
            "broad-leaved_purple_coneflower",
            "eastern_purple_coneflower",
            "eastern_purple-coneflower",
            "purple_cone-flower",
            "purple_coneflower",
            "purple-coneflower"
        ],
        "resource_links": [
            "https://en.wikipedia.org/wiki/echinacea%20purpurea"
        ],
        "species_description": "Echinacea purpurea, the eastern purple coneflower, purple coneflower, hedgehog coneflower, or echinacea, is a North American species of flowering plant in the family Asteraceae. It is native to parts of eastern North America and present to some extent in the wild in much of the eastern, southeastern and midwestern United States as well as in the Canadian Province of Ontario. It is most common in the Ozarks and in the Mississippi/Ohio Valley. Its habitats include dry open woods, prairies and barrens.",
        "image_links": [
            "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8e/Echinacea_purpurea_Grandview_Prairie.jpg/220px-Echinacea_purpurea_Grandview_Prairie.jpg"
        ]
    },
    {
        "species_id": "5552ed74-85bb-44df-b3fa-84307cb168bf",
        "scientific_name": [
            "echinacea_purpurea_‘white_swan’"
        ],
        "common_name": [
            "white_swan_coneflower"
        ],
        "resource_links": [
            "https://bcinvasives.ca/play-your-part/plantwise/grow-me-instead/white-swan-coneflower/"
        ],
        "species_description": "White swan coneflower is a white-petaled, sturdy coneflower choice resembling a classic daisy. It is very attractive to pollinators and blooms all summer with deadheading. This plant will form clumps growing to 1 m tall and 0.5 m spread. Its flowers are attractive to bees and butterflies and the resulting seed heads in late summer and fall are food for native bird species.\n\nWhen selecting non-invasive plants for your garden, be sure to look for those that are suitable for your location, including moisture requirements, hardiness zone, and avoidance of known bear attractants among other factors.",
        "image_links": [
            "https://www.gardenia.net/wp-content/uploads/2023/05/echinacea-purpurea-white-swan-coneflower-780x520.webp"
        ]
    },
    {
        "species_id": "706e52f0-a942-4552-a209-28e7f00c31d9",
        "scientific_name": [
            "elaeagnus_commutata"
        ],
        "common_name": [
            "Silver-berry"
        ],
        "resource_links": [
            "https://en.wikipedia.org/wiki/elaeagnus%20commutata"
        ],
        "species_description": "Elaeagnus commutata, the silverberry or wolf-willow, is a species of Elaeagnus native to western and boreal North America, from southern Alaska through British Columbia east to Quebec, south to Utah, and across the upper Midwestern United States to South Dakota and western Minnesota. It typically grows on dry to moist sandy and gravel soils in steppes, meadows or woodland edges.",
        "image_links": [
            "https://upload.wikimedia.org/wikipedia/commons/thumb/2/23/Elaeagnus_commutata_USDA.jpg/220px-Elaeagnus_commutata_USDA.jpg"
        ]
    },
    {
        "species_id": "b0bbe299-3324-4850-91fd-ba2fc2c6a92e",
        "scientific_name": [
            "epimedium_spp."
        ],
        "common_name": [
            "barrenwort",
            "bishop's_hat",
            "fairy_wings",
            "horny_goat_weed",
            "yin_yang_huo"
        ],
        "resource_links": [
            "https://en.wikipedia.org/wiki/Epimedium"
        ],
        "species_description": "Species of Epimedium are herbaceous perennials, growing from an underground rhizome. Their growth habits are somewhat variable. Some have solitary stems, others have a \"tufted\" habit, with multiple stems growing close together. There may be several leaves to a stem or the leaves may be solitary, produced from the base of the plant. Individual leaves are generally compound, often with three leaflets, but also with more. Leaflets usually have spiny margins. The leaves may be annual, making the plant deciduous, or longer lasting, so that the plant is evergreen. The inflorescence is an open raceme or panicle, the number of flowers varying by species.\n\nIndividual flowers have parts in fours. There are four smaller outer sepals, usually greenish and shed when the flower opens. Moving inwards, these are followed by four larger petal-like inner sepals, often brightly coloured. Inside the sepals are four true petals. These may be small and flat, but often have a complex shape including a nectar-producing \"spur\" that may be longer than the sepals. There are four stamens.\n\nOne of the common names for the genus, bishop's hat, arises from the shape of the flowers, particularly where the spurs are longer than the sepals.\\\\",
        "image_links": [
            "https://upload.wikimedia.org/wikipedia/commons/thumb/2/2a/Elfenblume_%28Epimedium_x_versicolor%29.jpg/440px-Elfenblume_%28Epimedium_x_versicolor%29.jpg"
        ]
    },
    {
        "species_id": "38b34da5-de5b-4f0f-a0cf-b0ddc7074c8a",
        "scientific_name": [
            "erigeron_compositus"
        ],
        "common_name": [
            "dwarf_mountain_fleabane"
        ],
        "resource_links": [
            "https://en.wikipedia.org/wiki/erigeron%20compositus"
        ],
        "species_description": "Erigeron compositus is an Arctic and alpine species of fleabane in the family Asteraceae. Common names include dwarf mountain fleabane, cutleaf daisy, and trifid mountain fleabane.\n\nErigeron compositus is a perennial herb rarely more than 25 cm (10 in) tall, with a thick growth of basal leaves, the tips of which are divided. The plant produces a taproot and spreads by means of horizontal underground rhizomes. The leaves are often densely hairy but can range to fully glabrous. There is generally only one flower head per stem, each head with 20–60 white, pink or blue ray florets; these are sometimes small and easily mistaken for disc florets. Genuine disc florets are yellow and in the center of the head. The flower stem and bract is covered with hairs, often glandular.",
        "image_links": [
            "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8b/Erigeron_compositus_%288161931839%29.jpg/220px-Erigeron_compositus_%288161931839%29.jpg",
            "https://upload.wikimedia.org/wikipedia/commons/thumb/c/cc/Erigeron_compositus_JHT_IMG_3791.jpg/220px-Erigeron_compositus_JHT_IMG_3791.jpg"
        ]
    },
    {
        "species_id": "4851893a-fa34-4c7d-a695-d5efe91c43a0",
        "scientific_name": [
            "erigeron_glabellus"
        ],
        "common_name": [
            "smooth_fleabane",
            "streamside_fleabane"
        ],
        "resource_links": [
            "https://en.wikipedia.org/wiki/erigeron%20glabellus"
        ],
        "species_description": "Erigeron glabellus is a North American species of flowering plants in the family Asteraceae, called the streamside fleabane.Erigeron glabellus is widespread across much of the colder parts of western North America. In Canada, it has been found in Yukon, Northwest Territories, British Columbia, all three Prairie Provinces, and Ontario. In the United States, it grows in Alaska, the northern part of the contiguous United States from Washington to Wisconsin, and in the Rocky Mountains as far south as Arizona and New Mexico.Erigeron glabellus is distinguished from related species by its extremely narrow ray florets, sometimes reduced to thread-like strands. The plant is a perennial herb up to 70 centimeters (28 inches) in height. It sometimes produces only one flower head per stem, sometimes a group of up to 10. Each head has as many as 175 white, pink, or blue ray florets surrounding numerous yellow disc florets.",
        "image_links": [
            "https://upload.wikimedia.org/wikipedia/commons/thumb/3/32/Erigeron_glabellus0.jpg/220px-Erigeron_glabellus0.jpg"
        ]
    },
    {
        "species_id": "9fe90bd3-d9de-4d25-b213-efb4dab14e76",
        "scientific_name": [
            "erigeron_speciosus"
        ],
        "common_name": [
            "aspen_fleabane",
            "garden_fleabane",
            "showy_fleabane"
        ],
        "resource_links": [
            "https://en.wikipedia.org/wiki/erigeron%20speciosus"
        ],
        "species_description": "Erigeron speciosus is a widespread North American species of flowering plants in the family Asteraceae known by the common names aspen fleabane, garden fleabane, and showy fleabane.",
        "image_links": [
            "https://upload.wikimedia.org/wikipedia/commons/thumb/8/80/Erigeron_speciosus_01.jpg/220px-Erigeron_speciosus_01.jpg"
        ]
    },
    {
        "species_id": "225df5fa-eaf8-4214-b0f2-fd8a48303bf2",
        "scientific_name": [
            "eriophorum_angustifolium"
        ],
        "common_name": [
            "common_cottongrass",
            "common_cottonsedge"
        ],
        "resource_links": [
            "https://en.wikipedia.org/wiki/eriophorum%20angustifolium"
        ],
        "species_description": "Eriophorum angustifolium, commonly known as common cottongrass or common cottonsedge, is a species of flowering plant in the sedge family, Cyperaceae. Native to North America, North Asia, and Northern Europe, it grows on peat or acidic soils, in open wetland, heath or moorland. It begins to flower in April or May and, after fertilisation in early summer, the small, unremarkable brown and green flowers develop distinctive white bristle-like seed-heads that resemble tufts of cotton; combined with its ecological suitability to bog, these characteristics give rise to the plant's alternative name, bog cotton.Eriophorum angustifolium is a hardy, herbaceous, rhizomatous, perennial sedge, able to endure in a variety of environments in the temperate, subarctic and arctic regions of Earth. Unlike Gossypium, the genus from which cotton is derived, the bristles which grow on E. angustifolium are unsuited to textile manufacturing. Nevertheless, in Northern Europe, they were used as a substitute in the production of paper, pillows, candle-wicks, and wound-dressings. The indigenous peoples of North America use the plant in cooking and in the treatment of digestive problems. Following a vote in 2002, Plantlife International designated E. angustifolium the County Flower of Greater Manchester, as part of its British County Flowers campaign.",
        "image_links": [
            "https://upload.wikimedia.org/wikipedia/commons/thumb/9/92/Eriophorum_angustifolium_upernavik_2007-08-01_1.jpg/220px-Eriophorum_angustifolium_upernavik_2007-08-01_1.jpg"
        ]
    },
    {
        "species_id": "3d18d127-69aa-454c-8555-ee98afc24227",
        "scientific_name": [
            "eupatorium_maculatum"
        ],
        "common_name": [
            "eupatorium_maculatum"
        ],
        "resource_links": [
            "https://en.wikipedia.org/wiki/eupatorium%20maculatum"
        ],
        "species_description": "Eutrochium maculatum,  the spotted joe-pyeweed, is a North American species of flowering plant in the family Asteraceae. It is widespread through much of the United States and Canada. It is the only species of the genus Eutrochium  found west of the Great Plains.This herbaceous perennial sometimes grows as high as 2 m (6 ft 7 in). Stems are sometimes completely purple, sometimes green with purple spots. One plant can produce numerous rose-purple flower heads in late summer, each head with  8-22 disc flowers but no ray flowers. The specific name maculatum, meaning spotted, refers to the purple spots on the stem.Spotted joe-pyeweed thrives in marshes, rich fens and swamps. It also does well in man-made moist expanses such as ditches, seepage areas and wet fields. Above all else the plant flourishes in the non-shaded environments that are also abundant in wetlands.It is a larval host to the Clymene moth, the eupatorium borer moth, the ruby tiger moth, and the three-lined flower moth. The plant also attracts butterflies and honeybees.",
        "image_links": [
            "https://upload.wikimedia.org/wikipedia/commons/thumb/e/ee/Flower_Buds.JPG/220px-Flower_Buds.JPG"
        ]
    },
    {
        "species_id": "d21eed1b-3d1e-4ba3-aec1-baefb674d544",
        "scientific_name": [
            "eupatorium_perfoliatum"
        ],
        "common_name": [
            "boneset",
            "common_boneset",
            "perfoliate_thoroughwort"
        ],
        "resource_links": [
            "https://en.wikipedia.org/wiki/eupatorium%20perfoliatum"
        ],
        "species_description": "Eupatorium perfoliatum, known as common boneset or just boneset, is a North American perennial plant in the family Asteraceae. It is a common native to the Eastern United States and Canada, widespread from Nova Scotia to Florida, west as far as Texas, Nebraska, the Dakotas, and Manitoba. It is also called agueweed, feverwort, or sweating-plant. It was introduced to American colonists by natives who used the plant for breaking fevers by means of heavy sweating. It is nearly always found in low, wet areas.",
        "image_links": [
            "https://upload.wikimedia.org/wikipedia/commons/thumb/6/6a/Eupatorium_perfoliatum_001.JPG/220px-Eupatorium_perfoliatum_001.JPG"
        ]
    },
    {
        "species_id": "25593872-101b-451f-86f1-fe4b1f3bd931",
        "scientific_name": [
            "euphorbia_amygdaloides"
        ],
        "common_name": [
            "wood spurge",
            "Wood Spurge"
        ],
        "resource_links": [
            "https://en.wikipedia.org/wiki/euphorbia%20amygdaloides"
        ],
        "species_description": "Euphorbia amygdaloides, the wood spurge, is a species of flowering plant in the family Euphorbiaceae, native to woodland locations in Europe, Turkey and the Caucasus. It is a bushy evergreen perennial, growing to a height of 80 cm (31 in), with dark green slightly hairy leaves about 6 cm (2 in) long. The complex green-yellow inflorescence (cyathium), typical of Euphorbia, appears in late spring and early summer.It is among the few plants that thrive in the dry shade of trees, where it is used as groundcover. It spreads rapidly by underground rhizomes and can become invasive, though relatively easy to remove.One form known is Euphorbia ‘Efanthia’. The subspecies E. amygdaloides subsp. robbiae (Turrill) Stace, known as Mrs Robb's bonnet, is grown as a garden plant, and has gained the Royal Horticultural Society’s Award of Garden Merit.The milky latex of the plant is toxic and can cause irritation on contact with the skin.",
        "image_links": [
            "https://upload.wikimedia.org/wikipedia/commons/thumb/4/40/Amandelwolfsmelk_Euphorbia_amygdaloides_closeup.jpg/220px-Amandelwolfsmelk_Euphorbia_amygdaloides_closeup.jpg"
        ]
    },
    {
        "species_id": "9f809c25-d2d7-43c4-90a8-cf280216c23b",
        "scientific_name": [
            "euphorbia_polychroma"
        ],
        "common_name": [
            "cushion_spurge"
        ],
        "resource_links": [
            "https://en.wikipedia.org/wiki/euphorbia%20polychroma"
        ],
        "species_description": "Euphorbia epithymoides, the cushion spurge, syn. E. polychroma, is a species of flowering plant in the family Euphorbiaceae, native to Libya, Turkey and East, Middle, and Southeast Europe. It is a compact, clump-forming, herbaceous perennial growing to 45 cm (18 in), bearing terminal cymes of acid yellow flower-heads (cyathia) in spring and summer.The cultivar 'Major' has gained the Royal Horticultural Society's Award of Garden Merit.",
        "image_links": [
            "https://upload.wikimedia.org/wikipedia/commons/thumb/e/ed/Euphorbia_epithymoides_MA.jpg/220px-Euphorbia_epithymoides_MA.jpg"
        ]
    },
    {
        "species_id": "587ee491-0a39-4001-948b-8083ed852461",
        "scientific_name": [
            "euphorbia_x_martinii"
        ],
        "common_name": [
            "martin's_spurge"
        ],
        "resource_links": [
            "https://en.wikipedia.org/wiki/Euphorbia_%C3%97_martini"
        ],
        "species_description": "Euphorbia × martini, or Martin’s spurge, is a hybrid between two species of flowering plant, E. amygdaloides × E. characias subsp. characias in the spurge family Euphorbiaceae. It was found growing wild in southern France. Growing to 60 cm (24 in) tall and broad, it is a dwarf evergreen subshrub with narrow grey-green leaves and in late spring and early summer, sprays of lime green flowers, often with a red or maroon eye. It is useful as a spreading, weed-smothering groundcover. Though hardy down to −15 °C (5 °F), it is a Mediterranean plant best grown in a sheltered spot in well-drained soil in full sun.\n\nAll parts of the plant are toxic if eaten, moreover euphorbias produce an irritant milky sap when cut or broken.",
        "image_links": [
            "https://www.gardenia.net/wp-content/uploads/2023/05/Euphorbia-Martinii-Martins-Spurge.webp",
            "https://upload.wikimedia.org/wikipedia/commons/thumb/1/1c/Euphorbia_x_martinii.jpg/440px-Euphorbia_x_martinii.jpg"
        ]
    },
    {
        "species_id": "bf948edb-61f9-4dd1-a27e-1248017ec878",
        "scientific_name": [
            "fraxinus_latifolia"
        ],
        "common_name": [
            "oregon_ash"
        ],
        "resource_links": [
            "https://en.wikipedia.org/wiki/fraxinus%20latifolia"
        ],
        "species_description": "Fraxinus latifolia, the Oregon ash, is a member of the ash genus Fraxinus, native to western North America.",
        "image_links": [
            "https://upload.wikimedia.org/wikipedia/commons/thumb/f/fe/Fraxinus_latifolia_JPG1A.jpg/220px-Fraxinus_latifolia_JPG1A.jpg",
            "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8b/Fraxinus_latifolia_JPG1Fe.jpg/220px-Fraxinus_latifolia_JPG1Fe.jpg"
        ]
    },
    {
        "species_id": "e7d3ffc8-0ce7-4459-ae22-21b40332d5cb",
        "scientific_name": [
            "gaultheria_shallon"
        ],
        "common_name": [
            "salal",
            "shallal"
        ],
        "resource_links": [
            "https://en.wikipedia.org/wiki/gaultheria%20shallon"
        ],
        "species_description": "Gaultheria shallon is an evergreen shrub in the heather family (Ericaceae), native to western North America.  In English, it is known as salal, shallon, or (mainly in Britain) gaultheria.",
        "image_links": [
            "https://upload.wikimedia.org/wikipedia/commons/thumb/2/20/Gaultheria_shallon_RF.jpg/220px-Gaultheria_shallon_RF.jpg"
        ]
    },
    {
        "species_id": "239389ea-9e00-4e10-b7e3-56fb807f5455",
        "scientific_name": [
            "gilia_capitata"
        ],
        "common_name": [
            "Blue Thimble-flower",
            "Bluehead Gilia",
            "blue field gilia",
            "globe gilia"
        ],
        "resource_links": [
            "https://en.wikipedia.org/wiki/gilia%20capitata"
        ],
        "species_description": "Gilia capitata is a species of flowering plant in the phlox family known by the common names blue-thimble-flower, bluehead gilia, blue field gilia, and globe gilia.",
        "image_links": [
            "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4c/Gilia_capitata.JPG/220px-Gilia_capitata.JPG"
        ]
    },
    {
        "species_id": "6ba4acbf-63e7-4662-bf1f-b243e5a7e8e3",
        "scientific_name": [
            "goniolimon_tataricum"
        ],
        "common_name": [
            "statice",
            "Tartarian statice"
        ],
        "resource_links": [
            "https://en.wikipedia.org/wiki/goniolimon%20tataricum"
        ],
        "species_description": "Goniolimon tataricum is a species of flowering plant in the genus Goniolimon, family Plumbaginaceae. It is called German statice, Tatarian sea-lavender, Tartarian statice or just statice. It is native to Albania, Algeria, Bulgaria, Greece, Kazakhstan, the North Caucasus, Romania, Southern Russia, Tunisia, Ukraine and the former Yugoslavia. It is planted in gardens as a border and ground cover, and also used in the cut flower industry.",
        "image_links": [
            "https://upload.wikimedia.org/wikipedia/commons/thumb/3/38/Goniolimon_tataricum.jpg/220px-Goniolimon_tataricum.jpg"
        ]
    },
    {
        "species_id": "c1b0058a-4b5d-4748-b97f-8368b520dd05",
        "scientific_name": [
            "helianthemum_nummularium"
        ],
        "common_name": [
            "common_rock-rose"
        ],
        "resource_links": [
            "https://en.wikipedia.org/wiki/helianthemum%20nummularium"
        ],
        "species_description": "Helianthemum nummularium (known as common rock-rose) is a species of rock-rose (Cistaceae), native to most of Europe.",
        "image_links": [
            "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a8/Sonnenr%C3%B6schen.jpg/220px-Sonnenr%C3%B6schen.jpg"
        ]
    },
    {
        "species_id": "04a32ee2-98b3-4406-a7a0-a2b7fd219c09",
        "scientific_name": [
            "hemerocallis_hybrids"
        ],
        "common_name": [
            "daylily"
        ],
        "resource_links": [
            "https://en.wikipedia.org/wiki/Daylily"
        ],
        "species_description": "A daylily or day lily is a flowering plant in the genus Hemerocallis /ˌhɛmɪroʊˈkælɪs/, a member of the family Asphodelaceae, subfamily Hemerocallidoideae, native to Asia. Despite the common name, it is not in fact a lily. Gardening enthusiasts and horticulturists have long bred daylily species for their attractive flowers. Thousands of cultivars have been registered by local and international Hemerocallis societies. Daylilies are perennial plants, whose name alludes to its flowers, which typically last about a day.",
        "image_links": [
            "",
            ""
        ]
    },
    {
        "species_id": "895dc13e-17e5-414d-b6f2-4b4426f76d52",
        "scientific_name": [
            "hibiscus_moscheutos"
        ],
        "common_name": [
            "common_rose-mallow",
            "crimson-eyed_rose-mallow",
            "sea_hollyhock",
            "swamp_rose-mallow",
            "water_mallow"
        ],
        "resource_links": [
            "https://en.wikipedia.org/wiki/hibiscus%20moscheutos"
        ],
        "species_description": "Hibiscus moscheutos, the rose mallow, swamp rose-mallow, crimsoneyed rosemallow, or eastern rosemallow, is a species of flowering plant in the family Malvaceae. It is a cold-hardy perennial wetland plant that can grow in large colonies. The hirsute leaves are of variable morphology, but are commonly deltoidal in shape with up to three lobes. It is found in wetlands and along the riverine systems of the eastern United States from Texas to the Atlantic states, its territory extending northward to southern Ontario.Numerous forms exist in nature. Petal colors range from pure white to deep rose, and most have an eye of deep maroon. Taxonomic consensus is lacking for the nomenclature of the multiple subspecies. The flowers are borne apically, whereas the related Hibiscus laevis carries bud and bloom along the stem.",
        "image_links": [
            "https://upload.wikimedia.org/wikipedia/commons/thumb/d/db/Swamp_rose-mallow.jpg/220px-Swamp_rose-mallow.jpg"
        ]
    },
    {
        "species_id": "f08cc16a-003f-4369-9850-5f22ab68dd9f",
        "scientific_name": [
            "hippuris_vulgaris"
        ],
        "common_name": [
            "mare's-tail",
            "common_mare's-tail"
        ],
        "resource_links": [
            "https://en.wikipedia.org/wiki/hippuris%20vulgaris"
        ],
        "species_description": "Hippuris vulgaris (from Greek: ἵππος — horse and οὐρά — tail), known as mare's-tail or common mare's-tail, is a common aquatic plant of Eurasia and North America ranging from Greenland to the Tibetan Plateau to Arizona. It prefers non-acidic waters.",
        "image_links": [
            "https://upload.wikimedia.org/wikipedia/commons/thumb/0/09/Hippuris_vulgaris_%28aka%29.jpg/220px-Hippuris_vulgaris_%28aka%29.jpg"
        ]
    },
    {
        "species_id": "9eac3bbe-7ece-417f-b8f1-086fad8ec18f",
        "scientific_name": [
            "hosta_spp._and_hybrids"
        ],
        "common_name": [
            "hosta"
        ],
        "resource_links": [
            "https://bcinvasives.ca/play-your-part/plantwise/grow-me-instead/hosta/"
        ],
        "species_description": "Hostas are a herbaceous perennial grown for their foliage. There are many different types of hosta: Over 70 species and 3,000 different cultivars in all different sizes and colors. Hostas are very shade tolerant and have white to violet bell-shaped flowers that bloom in the summer. They like to be planted in moist, well-drained soil.\n\nWhen selecting non-invasive plants for your garden, be sure to look for those that are suitable for your location, including moisture requirements, hardiness zone, and avoidance of known bear attractants among other factors.",
        "image_links": [
            "https://bcinvasives.ca/wp-content/uploads/2021/05/Hosta-002_Hosta-spp._J-Ruter_University-of-Georgia_Bugwood.org_-1170x780.jpg"
        ]
    },
    {
        "species_id": "b47204d6-050c-4bd4-9ce4-fec581c2cf39",
        "scientific_name": [
            "ilex_x_aquipernyi_'san_jose'"
        ],
        "common_name": [
            "san_jose_holly"
        ],
        "resource_links": [
            "https://bcinvasives.ca/play-your-part/plantwise/grow-me-instead/san-jose-holly/"
        ],
        "species_description": "San Jose holly has been bred to closely resemble English holly without the invasive tendencies. This holly has the same glossy spiky leaves and abundant clusters of shiny red berries loved by birds (to get these berries you do need both a male and female tree planted close together). This hybrid has a narrow, conical shape and grows to 6 m tall. This holly is quite drought tolerant once established and does well in acidic soils.\n\nWhen selecting non-invasive plants for your garden, be sure to look for those that are suitable for your location, including moisture requirements, hardiness zone, and avoidance of known bear attractants among other factors.",
        "image_links": [
            "https://bcinvasives.ca/wp-content/uploads/2021/05/San-Jose-Holly_Credit-as-Image-courtesy-of-Longwood-Gardens-1170x780.jpg"
        ]
    },
    {
        "species_id": "96081c72-777c-46b2-bda0-ce8612b032f0",
        "scientific_name": [
            "ilex_x_meservae"
        ],
        "common_name": [
            "meserve_holly"
        ],
        "resource_links": [
            "https://bcinvasives.ca/play-your-part/plantwise/grow-me-instead/meserve-hollies/"
        ],
        "species_description": "Meserve holly is an evergreen tree growing to 3 m tall. There are female and male versions of this tree. They both have shiny, spiky, blue-green leaves but only the females have small white flowers that bloom in May, followed by glossy, red berries in the fall. The berries are very attractive to birds. Meserve holly grows best in moist, well-drained, slightly acidic soils and can be used as a hedge or specimen plant.\n\nWhen selecting non-invasive plants for your garden, be sure to look for those that are suitable for your location, including moisture requirements, hardiness zone, and avoidance of known bear attractants among other factors.",
        "image_links": [
            "https://bcinvasives.ca/wp-content/uploads/2021/05/Meserve-Holly_Holly-x-meservae__J-Ruter_University-of-Georgia_Bugwood.org_-1170x780.jpg"
        ]
    },
    {
        "species_id": "d2994853-3814-4e76-a549-ca8cfa07cc1b",
        "scientific_name": [
            "iris_ensata"
        ],
        "common_name": [
            "Beaked Iris"
        ],
        "resource_links": [
            "https://en.wikipedia.org/wiki/iris%20ensata"
        ],
        "species_description": "Iris ensata, the Japanese iris or Japanese water iris (Japanese: hanashōbu), formerly I. kaempferi, is a species of flowering plant in the family Iridaceae, native to Japan, China, Korea and Russia, and widely cultivated as an ornamental plant. \"Japanese iris\" may also refer to I. sanguinea and I. laevigata, both native to Japan.",
        "image_links": [
            "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f2/Iris_ensata_Thunb.jpg/220px-Iris_ensata_Thunb.jpg"
        ]
    },
    {
        "species_id": "91cd4973-98cc-48ba-b3a5-dee1a8b876ce",
        "scientific_name": [
            "iris_germanica",
            "iris"
        ],
        "common_name": [
            "Bearded Iris"
        ],
        "resource_links": [
            "https://en.wikipedia.org/wiki/iris%20germanica"
        ],
        "species_description": "Iris × germanica is the accepted name for a species of flowering plants in the family Iridaceae commonly known as the bearded iris or the German bearded iris. It is one of a group of hybrid origin.: 87  Varieties include I. × g. var. florentina.",
        "image_links": [
            "https://upload.wikimedia.org/wikipedia/commons/thumb/4/42/Iris_Germanica_2012-2.jpg/220px-Iris_Germanica_2012-2.jpg",
            "https://upload.wikimedia.org/wikipedia/commons/thumb/4/42/Deutsche_Schwertlilie_%28Iris_%C3%97_germanica%29_im_Garten.jpg/220px-Deutsche_Schwertlilie_%28Iris_%C3%97_germanica%29_im_Garten.jpg"
        ]
    },
    {
        "species_id": "717c1a37-4254-461a-b087-ca80d0a06b8e",
        "scientific_name": [
            "iris_missouriensis"
        ],
        "common_name": [
            "Rocky Mountain iris",
            "western blue flag",
            "western blue iris"
        ],
        "resource_links": [
            "https://en.wikipedia.org/wiki/iris%20missouriensis"
        ],
        "species_description": "Iris missouriensis (syn. I. montana) is a hardy flowering rhizomatous species of the genus Iris, in the family Iridaceae.  Its common names include western blue flag, Rocky Mountain iris, and Missouri flag.It is native to western North America. Its distribution is varied; it grows at high elevations in mountains and alpine meadows and all the way down to sea level in coastal hills.",
        "image_links": [
            "https://upload.wikimedia.org/wikipedia/commons/thumb/6/6e/Iris_missouriensis_9423.JPG/220px-Iris_missouriensis_9423.JPG"
        ]
    },
    {
        "species_id": "ed89ddf6-97e4-4534-b32c-c7176286be6d",
        "scientific_name": [
            "iris_sibirica"
        ],
        "common_name": [
            "siberian_iris"
        ],
        "resource_links": [
            "https://bcinvasives.ca/play-your-part/plantwise/grow-me-instead/siberian-iris/"
        ],
        "species_description": "These two cultivars of Siberian iris are attractive options, and both are tolerant to drought and excessive moisture. ‘Butter and Sugar’ has pale yellow and white flowers while ‘Caeser’s Brother’ has bright purple blooms. Both are clumping with slender, glasslike foliage. Planted together the purple and yellow make a fantastic colour contrast for the garden border or pondside planting.\n\nWhen selecting non-invasive plants for your garden, be sure to look for those that are suitable for your location, including moisture requirements, hardiness zone, and avoidance of known bear attractants among other factors.",
        "image_links": [
            "https://bcinvasives.ca/wp-content/uploads/2021/05/Siberian-Iris_Iris-sibirica_Dow-Gardens_Bugwood.org_-800x533.jpg"
        ]
    },
    {
        "species_id": "92380fd6-a71a-40e7-928e-c7484a285b36",
        "scientific_name": [
            "iris_tenax"
        ],
        "common_name": [
            "tough-leaf iris",
            "Oregon flag"
        ],
        "resource_links": [
            "https://en.wikipedia.org/wiki/iris%20tenax"
        ],
        "species_description": "Iris tenax is a species of Iris, known by the common names tough-leaved iris, Oregon iris, or more colloquially, flag.",
        "image_links": [
            "https://upload.wikimedia.org/wikipedia/commons/thumb/a/ad/Iris_Tenax%2C_Coastal_Oregon%2C_April_2015.jpg/220px-Iris_Tenax%2C_Coastal_Oregon%2C_April_2015.jpg"
        ]
    },
    {
        "species_id": "791a91b4-de41-4d37-a8ee-ea9e0fdb56cf",
        "scientific_name": [
            "iris_versicolor"
        ],
        "common_name": [
            "blue flag",
            "harlequin blue flag",
            "larger blue flag",
            "multi-coloured blue flag",
            "northern blue flag"
        ],
        "resource_links": [
            "https://en.wikipedia.org/wiki/iris%20versicolor"
        ],
        "species_description": "Iris versicolor is also commonly known as the blue flag, harlequin blueflag, larger blue flag, northern blue flag, and poison flag, plus other variations of these names, and in Britain and Ireland as purple iris.It is a species of Iris native to North America, in the Eastern United States and Eastern Canada. It is common in sedge meadows, marshes, and along streambanks and shores. The specific epithet versicolor means \"variously coloured\".It is one of the three Iris species in the Iris flower data set outlined by Ronald Fisher in his 1936 paper \"The use of multiple measurements in taxonomic problems\" as an example of linear discriminant analysis.",
        "image_links": [
            "https://upload.wikimedia.org/wikipedia/commons/thumb/2/27/Blue_Flag%2C_Ottawa.jpg/220px-Blue_Flag%2C_Ottawa.jpg"
        ]
    },
    {
        "species_id": "983b6175-1c79-4675-a4cc-289b1fcdae41",
        "scientific_name": [
            "iris_virginica"
        ],
        "common_name": [
            "blue_flag",
            "southern_blue_flag"
        ],
        "resource_links": [
            "https://en.wikipedia.org/wiki/iris%20virginica"
        ],
        "species_description": "Iris virginica, with the common name Virginia blueflag, Virginia iris, great blue flag, or southern blue flag, is a perennial species of flowering plant in the Iridaceae (iris) family, native to central and eastern North America.It was identified as a separate species by Edgar Anderson, and is one of the three Iris species in Anderson's Iris flower data set, used by Ronald Fisher in his 1936 paper \"The use of multiple measurements in taxonomic problems\" as an example of linear discriminant analysis.",
        "image_links": [
            "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f8/Iris_virginica_2.jpg/220px-Iris_virginica_2.jpg"
        ]
    },
    {
        "species_id": "2b32cb1d-dd8a-4463-88f1-1c339a9b8f3b",
        "scientific_name": [
            "koelreuteria_paniculata"
        ],
        "common_name": [
            "Goldenrain tree",
            "Pride-of-India",
            "goldenrain-tree",
            "varnishtree",
            "pride-of-India",
            "Pride-Of-India",
            "Pride-of-India"
        ],
        "resource_links": [
            "https://en.wikipedia.org/wiki/koelreuteria%20paniculata"
        ],
        "species_description": "Koelreuteria paniculata is a species of flowering plant in the family Sapindaceae, native to eastern Asia (China and Korea). It was introduced in Europe in 1747, and to America in 1763, and has become a popular landscape tree worldwide. Common names include goldenrain tree, pride of India, China tree, and the varnish tree.",
        "image_links": [
            "https://upload.wikimedia.org/wikipedia/commons/thumb/0/09/%28MHNT%29_Koelreuteria_paniculata_-Leaves_and_inflorescences_-_Palais_Niel.jpg/220px-%28MHNT%29_Koelreuteria_paniculata_-Leaves_and_inflorescences_-_Palais_Niel.jpg"
        ]
    },
    {
        "species_id": "82b32c1a-46ac-498a-99f0-50957510487b",
        "scientific_name": [
            "leucanthemum_x_superbum"
        ],
        "common_name": [
            "shasta_daisy"
        ],
        "resource_links": [
            "https://en.wikipedia.org/wiki/leucanthemum%20x%20superbum"
        ],
        "species_description": "Leucanthemum × superbum, the Shasta daisy, is a commonly grown flowering herbaceous perennial plant with the classic daisy appearance of white petals (ray florets) around a yellow disc, similar to the oxeye daisy Leucanthemum vulgare Lam, but larger.It originated as a hybrid produced in 1890 by the American horticulturist Luther Burbank from a number of daisies. First, he crossed Leucanthemum vulgare with Leucanthemum maximum; this double hybrid was itself crossed with Leucanthemum lacustre. The resulting Leucanthemum triple hybrid was crossed with Nipponanthemum nipponicum, creating an intergeneric cross of species from three continents. It was named after Mount Shasta, because its petals were the color of the snow. Some members of the genus are considered noxious weeds, but the Shasta daisy remains a favorite garden plant.Many cultivars are suitable for cut flowers, such as 'Becky', 'Esther Read', 'Silberprinzesschen' (Silver Princess), 'Snow Lady', 'Tinkerbell', 'Wirral Pride', 'Wirral Supreme'. The cultivars 'T.E. Killin' and 'Wirral Supreme'  have gained the Royal Horticultural Society's Award of Garden Merit.",
        "image_links": [
            "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f5/Leucanthemum_x_superbum_%27Becky%27_in_NH.jpg/220px-Leucanthemum_x_superbum_%27Becky%27_in_NH.jpg"
        ]
    },
    {
        "species_id": "e6c0ac07-c0b7-4c5b-81a4-ca51d09c97fb",
        "scientific_name": [
            "liatris_spicata"
        ],
        "common_name": [
            "dense_blazing_star"
        ],
        "resource_links": [
            "https://en.wikipedia.org/wiki/liatris%20spicata"
        ],
        "species_description": "Liatris spicata, the dense blazing star, prairie feather, gayfeather or button snakewort, is a herbaceous perennial flowering plant in the family Asteraceae. It is native to eastern North America where it grows in moist prairies and sedge meadows.The plants have tall spikes of purple flowers resembling bottle brushes or feathers that grow 1–5 ft (0.30–1.52 m) tall. The species grows in hardiness zones 3 - 8, stretching from the Midwest to the East Coast, eastern and western Canada.Common varieties include 'Alba' and 'Floristan White' which are white-flowering cultivars on 18 in (46 cm) tall spikes, 'Callilepsis' with long stems good for cut flowers, 'Floristan Violett' with a strong stem and thick, violet flower spikes preferred by florists, and 'Kobold' which stays small in size with deep purple flowers.Liatris spicata var. resinosa is found in the southern part of the species's natural range. The variable plants have only 5 or 6 flowers per head and the heads are more widely spaced on the stems; these differences are more pronounced when the plants are found in drier and coastal habitats.",
        "image_links": [
            "https://upload.wikimedia.org/wikipedia/commons/thumb/6/6f/Liatris_spicata_002.JPG/220px-Liatris_spicata_002.JPG"
        ]
    },
    {
        "species_id": "d5b8583e-354f-4da5-a50f-fa4a0eccb352",
        "scientific_name": [
            "limonium_latifolium"
        ],
        "common_name": [
            "sea_lavender"
        ],
        "resource_links": [
            "https://bcinvasives.ca/play-your-part/plantwise/grow-me-instead/sea-lavender/"
        ],
        "species_description": "Sea lavender is an herbaceous perennial popular in cut flower arrangements for its dramatic display of small flowers. In the garden, it forms a cloud-like, mounding shape of these delicate blooms. Sea lavender is extremely heat and drought tolerant. Its flowers are loved by butterflies. This plant grows to 75 cm tall and 70 cm wide.\n\nWhen selecting non-invasive plants for your garden, be sure to look for those that are suitable for your location, including moisture requirements, hardiness zone, and avoidance of known bear attractants among other factors.",
        "image_links": [
            "https://bcinvasives.ca/wp-content/uploads/2021/05/Sea-Lavender_-Limonium-latifolium_Dreamstime.com_-1170x780.jpg"
        ]
    },
    {
        "species_id": "3029e320-dcec-4b18-a111-456277c4de4c",
        "scientific_name": [
            "lindera_benzoin"
        ],
        "common_name": [
            "Allspice",
            "Benjamin Bush",
            "Benjamin-Bush",
            "Northern Spicebush",
            "Spicebush",
            "Wild Allspice",
            "Allspice",
            "Benjamin Bush",
            "Benjamin-Bush",
            "Northern Spicebush",
            "Spicebush",
            "Wild Allspice",
            "Benjamin Bush",
            "Allspice",
            "Northern Spicebush",
            "Spicebush",
            "Wild Allspice",
            "Benjamin-bush",
            "Spicebush"
        ],
        "resource_links": [
            "https://en.wikipedia.org/wiki/lindera%20benzoin"
        ],
        "species_description": "Lindera benzoin (commonly called spicebush, common spicebush, northern spicebush, wild allspice, or Benjamin bush) is a shrub in the laurel family. It is native to eastern North America, ranging from Maine and New York to Ontario in the north, and to Kansas, Texas, and northern Florida in the center and south. Within its native range it is a relatively common plant where it grows in the understory in moist, rich woods, especially those with exposed limestone.",
        "image_links": [
            "https://upload.wikimedia.org/wikipedia/commons/thumb/6/69/Spicebush_%284506720062%29.jpg/220px-Spicebush_%284506720062%29.jpg"
        ]
    },
    {
        "species_id": "541b0568-7352-4301-832b-539f982865ce",
        "scientific_name": [
            "linum_lewisii"
        ],
        "common_name": [
            "Lewis' Blue Flax",
            "Lewis' Flax",
            "Lewis' Wild Blue Flax",
            "Lewis' Wild Flax",
            "Prairie Flax",
            "Wild Blue Flax",
            "Lewis's Flax",
            "Prairie Flax",
            "Wild Blue Flax"
        ],
        "resource_links": [
            "https://en.wikipedia.org/wiki/linum%20lewisii"
        ],
        "species_description": "Linum lewisii (Linum perenne var. lewisii) (Lewis flax, blue flax or prairie flax) is a perennial plant in the family Linaceae, native to western North America from Alaska south to Baja California, and from the Pacific Coast east to the Mississippi River. It grows on ridges and dry slopes, from sea level in the north up to 11,000 feet (3,400 metres) in the Sierra Nevada.It is a slender herbaceous plant growing to 80 centimetres (31+1⁄2 inches) tall, with spirally arranged narrow lanceolate leaves 1–2 cm (1⁄2–3⁄4 in) long. The flowers are pale blue or lavender to white, often veined in darker blue, with five petals 1–1.5 cm long. The flowers open in the morning and fade, dropping their petals by noon on hot, sunny days.The plant was named for North American explorer Meriwether Lewis.",
        "image_links": [
            "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d0/Linum_lewisii%2C_blue_flax%2C_Albuquerque.JPG/220px-Linum_lewisii%2C_blue_flax%2C_Albuquerque.JPG"
        ]
    },
    {
        "species_id": "7b14034d-ff94-43ed-bce3-2cf0556a9b41",
        "scientific_name": [
            "liriodendron_tulipifera"
        ],
        "common_name": [
            "tulip_tree",
            "tulip-poplar",
            "yellow-poplar"
        ],
        "resource_links": [
            "https://en.wikipedia.org/wiki/liriodendron%20tulipifera"
        ],
        "species_description": "Liriodendron tulipifera—known as the tulip tree, American tulip tree, tulipwood, tuliptree, tulip poplar, whitewood, fiddletree, lynn-tree, hickory-poplar, and yellow-poplar—is the North American representative of the two-species genus Liriodendron (the other member is Liriodendron chinense), and the tallest eastern hardwood. It is native to eastern North America from Southern Ontario and possibly southern Quebec to Illinois eastward to southwestern Massachusetts and Rhode Island, and south to central Florida and Louisiana. It can grow to more than 50 m (160 ft) in virgin cove forests of the Appalachian Mountains, often with no limbs until it reaches 25–30 m (80–100 ft) in height, making it a very valuable timber tree. The tallest individual at the present time (2021) is one called the Fork Ridge Tulip Tree at a secret location in the Great Smoky Mountains of North Carolina. Repeated measurements by laser and tape-drop have shown it to be 191 feet 10 inches (58.47 m) in height. This is  the tallest known individual tree in eastern North America.It is fast-growing, without the common problems of weak wood strength and short lifespan often seen in fast-growing species. April marks the start of the flowering period in the Southern United States (except as noted below); trees at the northern limit of cultivation begin to flower in June. The flowers are pale green or yellow (rarely white), with an orange band on the tepals; they yield large quantities of nectar. The tulip tree is the state tree of Indiana, Kentucky, and Tennessee.",
        "image_links": [
            "https://upload.wikimedia.org/wikipedia/commons/thumb/3/37/Liriodendron_tulipifera_%28arbre%29_-_Laeken.JPG/220px-Liriodendron_tulipifera_%28arbre%29_-_Laeken.JPG",
            "https://upload.wikimedia.org/wikipedia/commons/thumb/5/5c/Liriodendron_tulipifera12.jpg/220px-Liriodendron_tulipifera12.jpg"
        ]
    },
    {
        "species_id": "7da77376-4f2a-42af-80c0-b2dd297f139d",
        "scientific_name": [
            "lobelia_cardinalis"
        ],
        "common_name": [
            "cardinal flower"
        ],
        "resource_links": [
            "https://en.wikipedia.org/wiki/lobelia%20cardinalis"
        ],
        "species_description": "Lobelia cardinalis, the cardinal flower (syn. L. fulgens), is a species of flowering plant in the bellflower family   Campanulaceae native to the Americas, from southeastern Canada south through the eastern and southwestern United States, Mexico and Central America to northern Colombia.",
        "image_links": [
            "https://upload.wikimedia.org/wikipedia/commons/thumb/3/37/Lobelia_cardinalis_-_Cardinal_Flower.jpg/220px-Lobelia_cardinalis_-_Cardinal_Flower.jpg"
        ]
    },
    {
        "species_id": "ead68b5e-ef9c-459d-a410-b34096f15293",
        "scientific_name": [
            "lonicera_ciliosa"
        ],
        "common_name": [
            "orange honeysuckle"
        ],
        "resource_links": [
            "https://en.wikipedia.org/wiki/lonicera%20ciliosa"
        ],
        "species_description": "Lonicera ciliosa, the orange honeysuckle or western trumpet honeysuckle is a honeysuckle native to forests of western North America. A deciduous shrub growing to 6 m (20 ft) tall with hollow twigs, the leaves are opposite, oval, 4–10 cm (1.6–3.9 in) long with the last pair on each twig merged to form a disk. The flowers are orange-yellow, 2–4 cm (0.79–1.57 in) long, with five lobes and trumpet shaped; they are produced in whorls above the disk-leaf on the ends of shoots. The fruit is a translucent orange-red berry less than 1 cm (0.39 in) diameter.",
        "image_links": [
            "https://upload.wikimedia.org/wikipedia/commons/thumb/6/6a/Lonicera_ciliosa_13335.JPG/220px-Lonicera_ciliosa_13335.JPG"
        ]
    },
    {
        "species_id": "3ab1d984-286b-4154-8ca0-f4a858232aad",
        "scientific_name": [
            "lupinus_arcticus"
        ],
        "common_name": [
            "Arctic Lupine"
        ],
        "resource_links": [
            "https://en.wikipedia.org/wiki/lupinus%20arcticus"
        ],
        "species_description": "Lupinus arcticus is a species of flowering plant in the legume family known by the common names Arctic lupine or subalpine lupine. It is native to northwestern North America, where it occurs from Oregon north to Alaska and east to Nunavut. It is a common wildflower in British Columbia.This is a perennial herb growing from a taproot and producing an erect stem up to 50 centimeters tall. The dark green, hairy leaves are borne upon rough, hairy petioles up to 17 centimeters long. The leaves are palmately compound, made up of 3 to 9 leaflets each measuring up to 6 centimeters long. The inflorescence is a raceme up to 15 centimeters long bearing up to 30 flowers. The flowers are usually blue, sometimes purple, and occasionally white. The banners of the pealike flowers may be tinged with pink. The fruit is a hairy, greenish to blackish legume pod 2 or 3 centimeters long. It contains up to 10 white-speckled black seeds each about half a centimeter long. The plant may hybridize with other lupine species when they grow together.This plant grows in several types of habitat, including fields of sedge and moss, alpine regions, and the hills of the Canadian Arctic Archipelago. It grows on tundra and in moist and wet substrates.This species has been the topic of some biological research. In 1967, it caused a stir when the seeds of this species were discovered in ancient lemming burrows dating back to the Pleistocene; the seeds were germinated and they produced plants, causing them to be declared the oldest viable seeds ever discovered. In 2009, a follow-up article detailed how radiocarbon dating was used to determine that the seeds were, in fact, just a few years old at the time of their discovery, and had probably fallen into the burrows not long before.The plant contains a neurotoxin called sparteine, possibly as a deterrent to herbivores such as the snowshoe hare. The levels of sparteine in the leaves cycle, becoming higher at night, when herbivory is more likely to occur. In addition to the hare, species of ground squirrel have been known to feed on the plant.",
        "image_links": [
            "https://upload.wikimedia.org/wikipedia/commons/thumb/1/1e/Lupinus_arcticus.jpg/220px-Lupinus_arcticus.jpg"
        ]
    },
    {
        "species_id": "287a9044-af32-4a67-8af4-4b8046e2bb0c",
        "scientific_name": [
            "lupinus_polyphyllus"
        ],
        "common_name": [
            "Garden Lupin",
            "Large-leaved lupin",
            "Russel lupin"
        ],
        "resource_links": [
            "https://en.wikipedia.org/wiki/lupinus%20polyphyllus"
        ],
        "species_description": "Lupinus polyphyllus, the large-leaved lupine, big-leaved lupine, many-leaved lupine, blue-pod lupine, or, primarily in cultivation, garden lupin, is a species of lupine (lupin) native to western North America from southern Alaska and British Columbia and western Wyoming, and south to Utah and California. It commonly grows along streams and creeks, preferring moist habitats.",
        "image_links": [
            "https://upload.wikimedia.org/wikipedia/commons/thumb/d/da/Lupinus_polyphyllus.JPG/220px-Lupinus_polyphyllus.JPG"
        ]
    },
    {
        "species_id": "d7b5c9d6-413a-4da8-84ad-3404037dec3b",
        "scientific_name": [
            "maianthemum_dilatatum"
        ],
        "common_name": [
            "deerberry",
            "May-lily",
            "false lily-of-the-valley"
        ],
        "resource_links": [
            "https://en.wikipedia.org/wiki/maianthemum%20dilatatum"
        ],
        "species_description": "Maianthemum dilatatum (snakeberry, two-leaved Solomon's seal or false lily of the valley) is a common rhizomatous perennial flowering plant that is native to western North America from northern California to the Aleutian islands, and Asia across the Kamchatka Peninsula, Japan, and Korea. It grows in coastal temperate rainforests, and is often the dominant groundcover plant in Sitka Spruce forests.",
        "image_links": [
            "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b9/Maianthemum_dilatatum_0764.JPG/220px-Maianthemum_dilatatum_0764.JPG"
        ]
    },
    {
        "species_id": "aad0f62b-1c34-4873-8b86-017df05f1335",
        "scientific_name": [
            "maianthemum_racemosum_subsp._amplexicaule"
        ],
        "common_name": [
            "false_solomon’s_seal"
        ],
        "resource_links": [
            "https://bcinvasives.ca/play-your-part/plantwise/grow-me-instead/false-solomons-seal/"
        ],
        "species_description": "False Solomon’s seal is known for elegant foliage. It is a native herbaceous forest understory perennial with arching stems and glossy bright green leaves with conspicuous venation. Small white flowers present in clusters at the end of the leaflets in early spring are very fragrant and followed by mottled red-and-green to red berries in mid to late summer. Just like False Lily of the Valley, False Solomon’s Seal requires moist, nutrient-rich soils, and a shady spot to thrive.\n\nWhen selecting non-invasive plants for your garden, be sure to look for those that are suitable for your location, including moisture requirements, hardiness zone, and avoidance of known bear attractants among other factors.",
        "image_links": [
            "https://bcinvasives.ca/wp-content/uploads/2021/05/False-Lily-of-the-Valley_Maianthemum-racemosum_D-Powell_USDA-Forest-Service_Bugwood.org_-1170x780.jpg"
        ]
    },
    {
        "species_id": "48474cbf-31e1-48ba-a373-1390697d126e",
        "scientific_name": [
            "mimulus_lewisii",
            "mimulus_lewisii_lewisii"
        ],
        "common_name": [
            "Lewis' monkeyflower",
            "purple monkeyflower"
        ],
        "resource_links": [
            "https://en.wikipedia.org/wiki/mimulus%20lewisii"
        ],
        "species_description": "Erythranthe lewisii (Lewis' monkeyflower, great purple monkeyflower) is a perennial plant in the family Phrymaceae. It is named in honor of explorer Meriwether Lewis.  Together with other species in Erythranthe, it serves as a model system for studying pollinator-based reproductive isolation. It was formerly known as Mimulus lewisii.",
        "image_links": [
            "https://upload.wikimedia.org/wikipedia/commons/thumb/5/54/Mimulus_lewisii_8189.JPG/220px-Mimulus_lewisii_8189.JPG"
        ]
    },
    {
        "species_id": "f1de84bf-780f-4b8e-bfce-49c2219a8ffb",
        "scientific_name": [
            "monarda_fistulosa"
        ],
        "common_name": [
            "oswego-tea",
            "mintleaf_beebalm",
            "wild_bergamot",
            "wildbergamot_beebalm",
            "wildbergamot_horsemint"
        ],
        "resource_links": [
            "https://en.wikipedia.org/wiki/monarda%20fistulosa"
        ],
        "species_description": "Monarda fistulosa, the wild bergamot or bee balm, is a wildflower in the mint family Lamiaceae, widespread and abundant as a native plant in much of North America. This plant, with showy summer-blooming pink to lavender flowers, is often used as a honey plant, medicinal plant, and garden ornamental.  The species is quite variable, and several subspecies or varieties have been recognized within it.",
        "image_links": [
            "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a8/Monarda_fistulosa_Arkansas.jpg/220px-Monarda_fistulosa_Arkansas.jpg"
        ]
    },
    {
        "species_id": "6c5f179c-b1ec-4494-b169-6b5b75b9c9af",
        "scientific_name": [
            "nuphar_lutea_subsp._polysepala"
        ],
        "common_name": [
            "yellow_pondlily"
        ],
        "resource_links": [
            "https://bcinvasives.ca/play-your-part/plantwise/grow-me-instead/yellow-waterlily/"
        ],
        "species_description": "Yellow pondlily is an aquatic species native to British Columbia with bright yellow flowers. This lily has large, egg- to heart-shaped leaves and single, fragrant, cup-like flowers that float on water.\n\nWhen selecting non-invasive plants for your garden, be sure to look for those that are suitable for your location, including moisture requirements, hardiness zone, and avoidance of known bear attractants among other factors.",
        "image_links": [
            "https://bcinvasives.ca/wp-content/uploads/2021/05/Yellow-Pond-lily_Nuphar-lutea_RRoutledge_Sault-College_Bugwood.org_-1170x780.jpg"
        ]
    },
    {
        "species_id": "0029869f-ad7f-4721-ae5f-3c207ea1c722",
        "scientific_name": [
            "nymphaea_odorata"
        ],
        "common_name": [
            "american_white_waterlily",
            "fragrant_water-lily",
            "beaver_root",
            "fragrant_white_water_lily",
            "white_water_lily",
            "sweet-scented_white_water_lily",
            "sweet-scented_water_lily"
        ],
        "resource_links": [
            "https://en.wikipedia.org/wiki/nymphaea%20odorata"
        ],
        "species_description": "Nymphaea odorata, also known as the American white waterlily, fragrant water-lily, beaver root, fragrant white water lily, white water lily, sweet-scented white water lily, and sweet-scented water lily, is an aquatic plant belonging to the genus Nymphaea. It can commonly be found in shallow lakes, ponds, and permanent slow moving waters throughout North America where it ranges from Central America to northern Canada. It is also reported from Brazil and Guyana.",
        "image_links": [
            "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f8/N.Odorata.jpg/220px-N.Odorata.jpg"
        ]
    },
    {
        "species_id": "128bbbe9-fc19-48f3-8a98-3677cd632d17",
        "scientific_name": [
            "osmanthus_heterophyllus"
        ],
        "common_name": [
            "Chinese-holly",
            "holly osmanthus",
            "holly-olive"
        ],
        "resource_links": [
            "https://en.wikipedia.org/wiki/osmanthus%20heterophyllus"
        ],
        "species_description": "Osmanthus heterophyllus (Chinese:t 柊樹, s 柊树, p zhōngshù; Japanese: 柊, Hiiragi), variously known as holly osmanthus, holly olive, and false holly, is a species of flowering plant in the olive family Oleaceae, native to eastern Asia in central and southern Japan (Honshū, Kyūshū, Shikoku, and the Ryukyu Islands) and Taiwan.",
        "image_links": [
            "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8a/Osmanthus_heterophyllus3.jpg/220px-Osmanthus_heterophyllus3.jpg"
        ]
    },
    {
        "species_id": "4a998e72-2ce1-49ef-865a-97a2ba0cea5d",
        "scientific_name": [
            "oxalis_oregana"
        ],
        "common_name": [
            "Oregon wood-sorrel",
            "redwood-sorrel"
        ],
        "resource_links": [
            "https://en.wikipedia.org/wiki/oxalis%20oregana"
        ],
        "species_description": "Oxalis oregana , known as redwood sorrel or Oregon oxalis, is a species of the wood sorrel family, Oxalidaceae, in the genus Oxalis native to moist Douglas-fir and coast redwood forests of western North America from southwestern British Columbia to Washington, Oregon, and California.",
        "image_links": [
            "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e4/Oxalis_oregana_4988.JPG/220px-Oxalis_oregana_4988.JPG"
        ]
    },
    {
        "species_id": "6a91d292-14e6-4dd6-80ae-16eef81fe2bb",
        "scientific_name": [
            "parthenocissus_tricuspidata"
        ],
        "common_name": [
            "Boston Ivy",
            "Boston-Ivy",
            "Japanese Creeper",
            "Japanese Ivy",
            "Japanese-Creeper",
            "Japanese-Ivy"
        ],
        "resource_links": [
            "https://en.wikipedia.org/wiki/parthenocissus%20tricuspidata"
        ],
        "species_description": "Parthenocissus tricuspidata is a flowering plant in the grape family (Vitaceae) native to eastern Asia in Korea, Japan, and northern and eastern China.  Although unrelated to true ivy, it is commonly known as Boston ivy, grape ivy, and Japanese ivy, and also as Japanese creeper, and by the name woodbine (though the latter may refer to a number of different vine species).",
        "image_links": [
            "https://upload.wikimedia.org/wikipedia/commons/thumb/a/ab/Poertschach_Hauptstrasse_Parthenocissus_tricuspidata_Blattwerk_04062015_4423.jpg/220px-Poertschach_Hauptstrasse_Parthenocissus_tricuspidata_Blattwerk_04062015_4423.jpg"
        ]
    },
    {
        "species_id": "5f0038b7-1519-4877-b720-4bebc53901d8",
        "scientific_name": [
            "penstemon_barbatus"
        ],
        "common_name": [
            "olden-beard_penstemon",
            "beardlip_penstemo"
        ],
        "resource_links": [
            "https://en.wikipedia.org/wiki/penstemon%20barbatus"
        ],
        "species_description": "Penstemon barbatus, known by the common names golden-beard penstemon, and beardlip penstemon, is a flowering plant native to the western United States. In Spanish-speaking New Mexico and southern Colorado, it is called varita de San Jose –  \"St. Joseph's staff\".The plant has spikes of clustered, tubular, scarlet blossoms with yellow hairs on their lower lip; the flowers are very attractive to hummingbirds. It is commonly grown in Xeriscape and conventional gardens, and several cultivars of different colors have been developed.The late-summer flowering of Penstemon barbatus coincides with the southern migration of the Rufous hummingbird, and the hummingbirds use the Scarlet buglers as \"filling stations\" for their long trip south.",
        "image_links": [
            "https://upload.wikimedia.org/wikipedia/commons/thumb/2/20/Penstemon_barbatus_kz01.jpg/220px-Penstemon_barbatus_kz01.jpg"
        ]
    },
    {
        "species_id": "bad135f6-8cf7-46ed-a3b2-08945c33d615",
        "scientific_name": [
            "penstemon_pinifolius"
        ],
        "common_name": [
            "pineneedle_beardtongue"
        ],
        "resource_links": [
            "https://en.wikipedia.org/wiki/penstemon%20pinifolius"
        ],
        "species_description": "Penstemon pinifolius, the pine-leaved penstemon or pine-needle beardtongue,  is a species of flowering plant in the plantain family Plantaginaceae, native to the southwestern USA.Growing to 20 cm (7.9 in) tall and broad, it is a small evergreen shrub with arching stems of narrow needle-like leaves and bright scarlet tubular flowers in summer. Its natural habitats in the rocky uplands of Arizona and New Mexico are a clue to its preferences in cultivation. Though moderately hardy to −10 °C (14 °F) it requires an extremely well-drained, sunny position with some protection from hard frosts in winter.The species and the cultivar 'Wisley Flame'  have both gained the Royal Horticultural Society's Award of Garden Merit. 'Mersea Yellow' is another notable cultivar, with brilliant lemon-yellow flowers.",
        "image_links": [
            "https://upload.wikimedia.org/wikipedia/commons/thumb/0/0f/Penstemon_pinifolius2.jpg/220px-Penstemon_pinifolius2.jpg"
        ]
    },
    {
        "species_id": "6fc6284a-dfc3-4bb6-9c99-583fd64764fe",
        "scientific_name": [
            "philadelphus_lewisii"
        ],
        "common_name": [
            "lewis'_mock-orange"
        ],
        "resource_links": [
            "https://en.wikipedia.org/wiki/philadelphus%20lewisii"
        ],
        "species_description": "Philadelphus lewisii, the Lewis' mock-orange, mock-orange, Gordon's mockorange, wild mockorange, Indian arrowwood, or syringa, is a deciduous shrub native to western North America, and is the state flower of Idaho.It was first collected for science by scientist and explorer Meriwether Lewis in 1806 during the Lewis and Clark Expedition, and so was named after him.",
        "image_links": [
            "https://upload.wikimedia.org/wikipedia/commons/thumb/6/69/Philadelphus_lewisii_5.jpg/220px-Philadelphus_lewisii_5.jpg"
        ]
    },
    {
        "species_id": "e64f498d-82d7-4334-ba42-d8db1658fd4f",
        "scientific_name": [
            "physocarpus_capitatus"
        ],
        "common_name": [
            "Pacific ninebark"
        ],
        "resource_links": [
            "https://en.wikipedia.org/wiki/physocarpus%20capitatus"
        ],
        "species_description": "Physocarpus capitatus, commonly called Pacific ninebark or tall ninebark, is a species of Physocarpus in the rose family native to western North America.",
        "image_links": [
            "https://upload.wikimedia.org/wikipedia/commons/thumb/0/0d/Physocarpus_capitatus_9540.JPG/220px-Physocarpus_capitatus_9540.JPG"
        ]
    },
    {
        "species_id": "a91305ec-b20d-4085-a386-df20de2801b2",
        "scientific_name": [
            "pontederia_cordata"
        ],
        "common_name": [
            "pickerelweed"
        ],
        "resource_links": [
            "https://en.wikipedia.org/wiki/pontederia%20cordata"
        ],
        "species_description": "Pontederia cordata, common name pickerelweed (USA) or pickerel weed (UK), is a monocotyledonous aquatic plant native to the American continents. It grows in a variety of wetlands, including pond and lake margins across an extremely large range from eastern Canada south to Argentina. A few examples include northern rivers, the Everglades and Louisiana.",
        "image_links": [
            "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4f/Pontederia_cordata_4_PP.jpg/220px-Pontederia_cordata_4_PP.jpg"
        ]
    },
    {
        "species_id": "8bf0227d-abfd-4479-aa20-a8ab3607650f",
        "scientific_name": [
            "pulmonaria_officinalis"
        ],
        "common_name": [
            "blue lungwort",
            "common lungwort"
        ],
        "resource_links": [
            "https://en.wikipedia.org/wiki/pulmonaria%20officinalis"
        ],
        "species_description": "Pulmonaria officinalis, common names lungwort, common lungwort, Mary's tears or Our Lady's milk drops, is a herbaceous rhizomatous evergreen perennial  plant of the genus Pulmonaria, belonging to the family Boraginaceae.",
        "image_links": [
            "https://upload.wikimedia.org/wikipedia/commons/thumb/7/71/Pulmonaria_officinalis_800.jpg/220px-Pulmonaria_officinalis_800.jpg"
        ]
    },
    {
        "species_id": "f26cd768-2d5e-4195-b6f9-e055b7b10346",
        "scientific_name": [
            "rhododendron_kiusianum_hybrids"
        ],
        "common_name": [
            "japanese_azalea"
        ],
        "resource_links": [
            "https://bcinvasives.ca/play-your-part/plantwise/grow-me-instead/japanese-evergreen-azalea/"
        ],
        "species_description": "Japanese azalea is a compact, dense shrub with glossy, leathery, oval leaves and masses of flowers in early spring. They are available is an enormous range of colors from bright violet, to red, to pink, yellow, orange, and white. This species has shallow roots so requires regular watering and well-drained, slightly acidic soil. This azalea is evergreen, so its glossy green foliage remains attractive all year long.\n\nWhen selecting non-invasive plants for your garden, be sure to look for those that are suitable for your location, including moisture requirements, hardiness zone, and avoidance of known bear attractants among other factors.",
        "image_links": [
            "https://bcinvasives.ca/wp-content/uploads/2021/05/Japanese-Azalea_Azalea-japonica_Dreamstime-800x533.jpg"
        ]
    },
    {
        "species_id": "cc75e617-6246-4688-ab30-5f9103093431",
        "scientific_name": [
            "rhus_aromatica"
        ],
        "common_name": [
            "aromatic sumac",
            "fragrant sumac",
            "lemon sumac",
            "skunkbrush",
            "sweet sumac"
        ],
        "resource_links": [
            "https://en.wikipedia.org/wiki/rhus%20aromatica"
        ],
        "species_description": "Rhus aromatica, the fragrant sumac, is a deciduous shrub in the family Anacardiaceae native to North America. It is found in southern Canada (Alberta to Quebec) and nearly all of the lower 48 states except peninsular Florida.Fragrant sumac is a woody plant with a rounded form that grows to around 2 ft (0.6 m) to 5 ft (1.5 m) tall and 5 ft (1.5 m) to 10 ft (3.0 m) wide. The plant develops yellow flowers in clusters on short lateral shoots in March through May. The flower is a small, dense inflorescence that usually opens before the plant's leaves do.The species is polygamodioecious (mostly dioecious, primarily bearing flowers of only one sex, but with either a few flowers of the opposite sex or a few bisexual flowers on the same plant). Male (staminate) flowers develop in yellowish catkins, while female (pistillate) flowers develop in short bright yellow panicles at the ends of branches.Pollinated flowers develop clusters of 5 mm (0.2 in) to 7 mm (0.3 in) hairy red drupes containing a single nutlet during June through August. The fruits become an important winter food for birds and small mammals that can remain on the plant until spring if not eaten.The plant's alternate compound leaves have three leaflets that vary in shape, lobing, and margination.  The unstalked leaflets are ovate to rhomboid, more or less wedge-shaped at the base, coarsely-toothed and usually shiny glabrous above. The terminal leaflet is 3 cm (1.2 in) to 6.5 cm (2.6 in) long.Fragrant sumac's three-leafleted lobed leaves resemble those of its relative, poison ivy (Toxicodendron radicans). However, poison ivy's central leaflet has a stem, whereas fragrant sumac's does not.The plant's  green to glossy blue-green summer foliage becomes orange to red or purple in the fall. Stems are thin and brownish-gray, with rust-colored lenticels when young. Leaves and stems emit a lemon scent when crushed. There are no terminal buds, but overwintering male catkins are present.Fragrant sumac is common along the forested eastern margins of the Great Plains and in open or otherwise disturbed sites on the margins of the Gulf Coast prairie. It grows at a range of sites including open rocky woodlands, valley bottoms, lower rocky slopes, and roadsides. It is not widely used for landscape plantings but is often used as a ground cover, especially on banks. The plant's colorful fall foliage is its main ornamental feature.The plant grows in full deep shade to full sun and well-drained soils slightly acid to well alkaline with a pH range of about 6.0 to 8.5. It has a shallow, fibrous root system and is easily transplanted. Some of its branches can trail upon the ground and develop roots.  The plant can ground sucker to form a colony.SpreadFoliagePistillate inflorescenceFruit",
        "image_links": [
            "https://upload.wikimedia.org/wikipedia/commons/thumb/4/48/Rhus_aromatica_foliage_catkins.jpg/220px-Rhus_aromatica_foliage_catkins.jpg"
        ]
    },
    {
        "species_id": "4ad9b13c-80ff-4de4-b4ba-f724259cc3d8",
        "scientific_name": [
            "rhus_glabra"
        ],
        "common_name": [
            "Red Sumac",
            "Scarlet Sumac",
            "Scarlet Sumach",
            "Smooth Sumac",
            "Smooth Sumach",
            "Upland Sumach",
            "Vinegar-Bush",
            "Vinegar-Tree",
            "Red Sumac",
            "Scarlet Sumac",
            "Scarlet Sumach",
            "Smooth Sumac",
            "Smooth Sumach",
            "Upland Sumach",
            "Vinegar-Bush",
            "Vinegar-Tree",
            "Scarlet Sumac",
            "Smooth Sumac",
            "Smooth Sumac",
            "Smooth Sumach",
            "Vinegar-bush",
            "Vinegar-tree",
            "Scarlet Sumac",
            "Scarlet Sumach",
            "Red Sumac",
            "Upland Sumach"
        ],
        "resource_links": [
            "https://en.wikipedia.org/wiki/rhus%20glabra"
        ],
        "species_description": "Rhus glabra, the smooth sumac, (also known as white sumac, upland sumac, or scarlet sumac) is a species of sumac in the family Anacardiaceae, native to North America, from southern Quebec west to southern British Columbia in Canada, and south to northern Florida and Arizona in the United States and Tamaulipas in northeastern Mexico.Smooth sumac has a spreading, open habit, growing up to 3 m (9.8 ft) tall, rarely to 5 m (16 ft). The leaves are alternate, 30–50 cm (12–20 in) long, compound with 11–31 oppositely paired leaflets, each leaflet 5–11 cm (2–4+1⁄4 in) long, with a serrated margin. The leaves turn scarlet in the fall. The flowers are tiny, green, produced in dense erect panicles 10–25 cm (4–10 in) tall, in the spring, later followed by large panicles of edible crimson berries that remain throughout the winter. The buds are small, covered with brown hair and borne on fat, hairless twigs. The bark on older wood is smooth and grey to brown.In late summer it sometimes forms galls on the underside of leaves, caused by the parasitic sumac leaf gall aphid, Melaphis rhois. The galls are not harmful to the tree.",
        "image_links": [
            "https://upload.wikimedia.org/wikipedia/commons/thumb/7/79/Rhus_glabra_AR.jpg/220px-Rhus_glabra_AR.jpg"
        ]
    },
    {
        "species_id": "6ab1f1e4-49e2-44bf-88af-caff79f10ff6",
        "scientific_name": [
            "ribes_sanguineum"
        ],
        "common_name": [
            "redflower_currant"
        ],
        "resource_links": [
            "https://en.wikipedia.org/wiki/ribes%20sanguineum"
        ],
        "species_description": "Ribes sanguineum, the flowering currant, redflower currant, red-flowering currant, or red currant is a North American species of flowering plant in the family Grossulariaceae, native to the western United States and Canada.",
        "image_links": [
            "https://upload.wikimedia.org/wikipedia/commons/thumb/9/99/Pink_Flowering_Currant_closeup%2C_Ribes_sanguineum.jpg/220px-Pink_Flowering_Currant_closeup%2C_Ribes_sanguineum.jpg"
        ]
    },
    {
        "species_id": "dfbc53e5-c57d-4d35-834c-175105338e58",
        "scientific_name": [
            "sagittaria_latifolia"
        ],
        "common_name": [
            "Duck-potato"
        ],
        "resource_links": [
            "https://en.wikipedia.org/wiki/sagittaria%20latifolia"
        ],
        "species_description": "Sagittaria latifolia is a plant found in shallow wetlands and is sometimes known as broadleaf arrowhead, duck-potato, Indian potato, or wapato. This plant produces edible tubers that have traditionally been extensively used by Native Americans.",
        "image_links": [
            "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c3/Sagittaria_latifolia_%28flowers%29.jpg/220px-Sagittaria_latifolia_%28flowers%29.jpg"
        ]
    },
    {
        "species_id": "a4007e6f-2b8b-43ed-9d33-2cc855ce3384",
        "scientific_name": [
            "salix_exigua"
        ],
        "common_name": [
            "coyote_willow",
            "desert_willow",
            "narrow-leaf_willow",
            "narrow-leaved_willow",
            "narrowleaf_willow",
            "sandbar_willow",
            "western_sandbar_willow"
        ],
        "resource_links": [
            "https://en.wikipedia.org/wiki/salix%20exigua"
        ],
        "species_description": "Salix exigua (sandbar willow, narrowleaf willow, or coyote willow; syn. S. argophylla, S. hindsiana, S. interior, S. linearifolia, S. luteosericea, S. malacophylla, S. nevadensis, and  S. parishiana) is a species of willow native to most of North America except for the southeast and far north, occurring from Alaska east to New Brunswick, and south to northern Mexico. It is considered a threatened species in Massachusetts while in Connecticut, Maryland, and New Hampshire it is considered endangered.",
        "image_links": [
            "https://upload.wikimedia.org/wikipedia/commons/thumb/3/34/Salix_exigua_staminate_catkin_2003-06-04.jpg/220px-Salix_exigua_staminate_catkin_2003-06-04.jpg"
        ]
    },
    {
        "species_id": "2d876b90-7780-45df-86c9-c2e16f9ca865",
        "scientific_name": [
            "salix_scouleriana"
        ],
        "common_name": [
            "_fire_willow",
            "nuttall_willow",
            "mountain_willow",
            "black_willow"
        ],
        "resource_links": [
            "https://en.wikipedia.org/wiki/salix%20scouleriana"
        ],
        "species_description": "Salix scouleriana (Scouler's willow; syn. S. brachystachys Benth., S. capreoides Anderss., S. flavescens Nutt., S. nuttallii Sarg., S. stagnalis Nutt.) is a species of willow native to northwestern North America. Other names occasionally used include fire willow, Nuttall willow, mountain willow, and black willow.",
        "image_links": [
            "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f9/Salix_scouleriana_UGA.jpg/220px-Salix_scouleriana_UGA.jpg"
        ]
    },
    {
        "species_id": "e6308c57-bc10-40fb-afa2-50855cd66e78",
        "scientific_name": [
            "salvia_guarantica"
        ],
        "common_name": [
            "blue_anise_sage"
        ],
        "resource_links": [
            "https://en.wikipedia.org/wiki/Salvia_guaranitica"
        ],
        "species_description": "Salvia guaranitica, the anise-scented sage or hummingbird sage, is a species of flowering plant in the sage family, Lamiaceae, native to a wide area of South America, including Brazil, Paraguay, Uruguay, and Argentina. It is cultivated all over the world, and is naturalized in New Zealand and Chile.",
        "image_links": [
            "https://upload.wikimedia.org/wikipedia/commons/thumb/7/7b/Salvia_Guaranitica.jpg/440px-Salvia_Guaranitica.jpg"
        ]
    },
    {
        "species_id": "953e1f21-0c26-4bd3-b5fb-456e06133ca9",
        "scientific_name": [
            "salvia_officinalis_'berggarten'"
        ],
        "common_name": [
            "berggarten_sage"
        ],
        "resource_links": [
            "https://bcinvasives.ca/play-your-part/plantwise/grow-me-instead/berggarten-sage/"
        ],
        "species_description": "Berggarten sage is a smaller, more compact version of the classic garden herb. It has soft, fuzzy foliage in an attractive silver-grey color. This sage rarely blooms but will occasionally flower with a pretty purple spike. This sage is evergreen. It prefers full sun and well-drained soils.\n\nWhen selecting non-invasive plants for your garden, be sure to look for those that are suitable for your location, including moisture requirements, hardiness zone, and avoidance of known bear attractants among other factors.",
        "image_links": [
            "https://bcinvasives.ca/wp-content/uploads/2021/05/Berggarten-Sage_Salvia-officinalis-Berggarten_Dreamstime-800x533.jpg"
        ]
    },
    {
        "species_id": "dc0b2c6b-756c-40af-95f0-4b4d998d642b",
        "scientific_name": [
            "sambucus_cerulea"
        ],
        "common_name": [
            "sambucus_cerulea_sambucus_nigra_subsp._cerulea"
        ],
        "resource_links": [
            "https://en.wikipedia.org/wiki/sambucus%20cerulea"
        ],
        "species_description": "Sambucus cerulea or Sambucus nigra ssp. cerulea, with the common names blue elderberry and blue elder, is a coarse textured shrub species of elder in the family Adoxaceae.",
        "image_links": [
            "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f1/Sambucus_caerulea_8012.jpg/220px-Sambucus_caerulea_8012.jpg"
        ]
    },
    {
        "species_id": "dcddf9dd-e773-4764-b591-411f082f2dc1",
        "scientific_name": [
            "sambucus_racemosa_subsp._pubens",
            "sambucus_racemosa_melanocarpa"
        ],
        "common_name": [
            "american_red_elder"
        ],
        "resource_links": [
            "https://en.wikipedia.org/wiki/sambucus%20racemosa%20subsp.%20pubens"
        ],
        "species_description": "Sambucus pubens, the American red elder, is a species of elder (Sambucus) native to eastern North America. The  inflorescence is a rounded panicle, making the plant easy to distinguish from the more common S. canadensis, which has a more open, flattened corymb. Some authors have considered S. pubens to be conspecific with S. racemosa L.",
        "image_links": [
            "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a0/Sambucus_pubens.jpg/220px-Sambucus_pubens.jpg",
            "https://upload.wikimedia.org/wikipedia/commons/thumb/0/0d/Sambucus_pubens_2_%285098100028%29.jpg/220px-Sambucus_pubens_2_%285098100028%29.jpg"
        ]
    },
    {
        "species_id": "caf9be05-4ea9-4164-bcdc-05cc7ec2a621",
        "scientific_name": [
            "sambucus_racemosa_var._melanocarpa"
        ],
        "common_name": [
            "black_elderberry"
        ],
        "resource_links": [
            "https://bcinvasives.ca/play-your-part/plantwise/grow-me-instead/black-elderberry/"
        ],
        "species_description": "Black elderberry is a branching, deciduous shrub with clusters of white flowers that bloom in the spring. The showy flowers are followed by bunches of shiny black berries in late summer. Black elderberry is tolerant of a range of environmental conditions, provided it is planted in a well-drained area. Depending on where it is planted, Black elderberry can reach from 1-6 m tall.\n\nWhen selecting non-invasive plants for your garden, be sure to look for those that are suitable for your location, including moisture requirements, hardiness zone, and avoidance of known bear attractants among other factors.",
        "image_links": [
            "https://bcinvasives.ca/wp-content/uploads/2021/05/Black-elderberry_Sambucus-nigra-spp.-canadensis_R-Webb_Bugwood.org_-1170x780.jpg"
        ]
    },
    {
        "species_id": "bc498517-e804-4990-afb3-d15eccb8993f",
        "scientific_name": [
            "sambucus_spp."
        ],
        "common_name": [
            "elderberry"
        ],
        "resource_links": [
            "https://bcinvasives.ca/play-your-part/plantwise/grow-me-instead/elderberry/"
        ],
        "species_description": "This genus is home to several species of deciduous shrubs 3-5 m tall with flat-topped clusters of flowers and pointed leaflets. Elderberry shrubs (also called elders) tolerate a range of soil conditions, but prefer nutrient-rich soils, and vary in berry colour from red, to black, to dusky blue, depending on species and variety. Elderberries are attractive to pollinators for their flowers and birds for their masses of sweet juicy berries.\n\nWhen selecting non-invasive plants for your garden, be sure to look for those that are suitable for your location, including moisture requirements, hardiness zone, and avoidance of known bear attractants among other factors.",
        "image_links": [
            "https://bcinvasives.ca/wp-content/uploads/2021/05/Red-elderberry_Sambucus-racemosa_D-Powell_USDA-Forest-Service_Bugwood.org_-1170x780.jpg"
        ]
    },
    {
        "species_id": "1f27ba2c-7095-43cf-b54e-9ad2a39fbbbc",
        "scientific_name": [
            "scirpus_microcarpus"
        ],
        "common_name": [
            "Panicled Bulrush",
            "Red-Sheathed Bulrush",
            "Red-Tinged Bulrush",
            "Small-Flowered Bulrush",
            "Small-Fruited Bulrush"
        ],
        "resource_links": [
            "https://en.wikipedia.org/wiki/scirpus%20microcarpus"
        ],
        "species_description": "Scirpus microcarpus is a species of flowering plant in the sedge family known by the common names panicled bulrush, smallfruit bulrush, and barberpole bulrush. It is native to North America, where it can be found throughout the northern and western regions, from Alaska across Canada to the northeastern United States, in most of the central and western states, and in Baja California. It grows in many types of moist and wet habitat. It is a perennial herb growing from a long rhizome system. The erect, three-angled stems often exceed one meter tall. Sheathing leaves occur at the stem bases as well as higher up the stems. The inflorescence is a panicle of many clusters of spikelets and leaflike bracts on long, thin branches. The fruit is a pale, smooth achene less than 2 millimeters long.",
        "image_links": [
            "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b0/Scirpus_microcarpus_FWS-1.jpg/220px-Scirpus_microcarpus_FWS-1.jpg"
        ]
    },
    {
        "species_id": "7ee6c700-99cd-4efa-8ddb-5deec02b1806",
        "scientific_name": [
            "sedum_lanceolatum"
        ],
        "common_name": [
            "common stonecrop",
            "lance-leaved stonecrop",
            "spear-leaved stonecrop"
        ],
        "resource_links": [
            "https://en.wikipedia.org/wiki/sedum%20lanceolatum"
        ],
        "species_description": "Sedum lanceolatum is a species of flowering plant in the family Crassulaceae known by the common names spearleaf stonecrop and lanceleaf stonecrop.It is native to western North America and occurs in western Canada and the United States. It is distributed from Alaska to Arizona and New Mexico and as far east as South Dakota and Nebraska. It grows in exposed, rocky mountainous habitat at moderate and high elevations, up to 4,048 metres (13,281 ft) in the Rocky Mountains. The plant persisted and evolved on sky islands and nunataks in these ranges during glaciation events during the Pleistocene epoch.This is a succulent plant forming basal rosettes of knobby or pointed leaves up to 3 centimetres (1.2 in) long. Smaller leaves occur farther up the stem and often fall away by the time the plant blooms. The stems are about 10–15 cm (4–6 in) tall. The inflorescence is made up of one or more erect arrays of several flowers. The flowers have yellow petals sometimes tinged with red, each lance-shaped petal just under a centimeter long. The stamens are tipped with yellow anthers. The plant reproduces sexually by its tiny, lightweight seeds, or vegetatively when sections of its stem break off and root.",
        "image_links": [
            "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f3/Sedum_lanceolatum_5926.JPG/220px-Sedum_lanceolatum_5926.JPG"
        ]
    },
    {
        "species_id": "cd47840c-77e4-4503-ab64-80c8dcc011cc",
        "scientific_name": [
            "sedum_oreganum"
        ],
        "common_name": [
            "Oregon stonecrop"
        ],
        "resource_links": [
            "https://en.wikipedia.org/wiki/sedum%20oreganum"
        ],
        "species_description": "Sedum oreganum is a species of succulent plant of the genus Sedum. It grows along the Pacific Coast of North America from Alaska to far northern California. The plant, known by the common name Oregon stonecrop, grows in many types of rocky habitat, including coastal bluffs and cliffs and the talus of higher inland mountains.",
        "image_links": [
            "https://upload.wikimedia.org/wikipedia/commons/thumb/8/80/Sedum_oreganum_0958.JPG/220px-Sedum_oreganum_0958.JPG"
        ]
    },
    {
        "species_id": "534b9c11-4fc2-41d3-a5e9-2c3ae4f5d027",
        "scientific_name": [
            "sedum_rupestre_'angelina'"
        ],
        "common_name": [
            "angelina_stonecrop"
        ],
        "resource_links": [
            "https://bcinvasives.ca/play-your-part/plantwise/grow-me-instead/angelina-stonecrop/"
        ],
        "species_description": "Angelina stonecrop is a low-growing, succulent, perennial groundcover with bright yellow to red-orange foliage and yellow, star-shaped flowers in the summer. Like most stonecrops, Angelina stonecrop requires well-drained soils such as in a rock garden. If allowed to spread, this plant will form attractive, creeping mats. Angelina stonecrop typically grows to 15 cm tall.\n\nWhen selecting non-invasive plants for your garden, be sure to look for those that are suitable for your location, including moisture requirements, hardiness zone, and avoidance of known bear attractants among other factors.",
        "image_links": [
            "https://bcinvasives.ca/wp-content/uploads/2021/05/Angelina-stonecrop_Sedum-rupestre-Angelina_Susan-Lawson_Dreamstime.com_-800x533.jpg"
        ]
    },
    {
        "species_id": "33aabe3b-9d73-48e9-8fad-83f6fd74a211",
        "scientific_name": [
            "sedum_spathulifolium"
        ],
        "common_name": [
            "Pacific stonecrop",
            "broad-leaved stonecrop",
            "spatula-leaved stonecrop"
        ],
        "resource_links": [
            "https://en.wikipedia.org/wiki/sedum%20spathulifolium"
        ],
        "species_description": "Sedum spathulifolium is a species of flowering plant in the family Crassulaceae known by the common names broadleaf stonecrop, yellow stonecrop, and spoon-leaved stonecrop. An evergreen perennial, it is native to western North America from British Columbia to southern California, where it can be found often in shade in many types of rocky habitat in coastal and inland hills and mountains.",
        "image_links": [
            "https://upload.wikimedia.org/wikipedia/commons/thumb/9/9d/Sedum_spathulifolium_5165.JPG/220px-Sedum_spathulifolium_5165.JPG"
        ]
    },
    {
        "species_id": "9bd75c27-3576-4b5a-b545-83e0015a1047",
        "scientific_name": [
            "solidago_altissima_subsp._gilvocanescens"
        ],
        "common_name": [
            "canada_goldenrod"
        ],
        "resource_links": [
            "https://bcinvasives.ca/play-your-part/plantwise/grow-me-instead/canada-goldenrod/"
        ],
        "species_description": "Canada goldenrod is a hardy native perennial that can be used as both a cut flower and as a tall border plant. It can grow up to 70 cm tall with slender, pointy, deep green leaves. Goldenrod flowers bloom in late summer. The deep yellow of the flowers are very attractive to pollinators and other beneficial insects. Goldenrod is tolerant of both wet and dry soils and is a low-maintenance, easy-care plant.\n\nWhen selecting non-invasive plants for your garden, be sure to look for those that are suitable for your location, including moisture requirements, hardiness zone, and avoidance of known bear attractants among other factors.",
        "image_links": [
            "https://bcinvasives.ca/wp-content/uploads/2021/05/Canada-goldenrod_Solidago-canadensis_Florida-Division-of-Plant-Industry_Florida-Dept-of-Agriculture-and-Consumer-Services_Bugwood.org_-800x533.jpg"
        ]
    },
    {
        "species_id": "3de0e7ce-47be-4ac4-9d5d-3fba4d4a26f8",
        "scientific_name": [
            "spiraea_betulifolia_subsp._lucida"
        ],
        "common_name": [
            "birchleaf_spirea"
        ],
        "resource_links": [
            "https://bcinvasives.ca/play-your-part/plantwise/grow-me-instead/birchleaf-spirea/"
        ],
        "species_description": "Native to Japan, Birchleaf spirea is a deciduous shrub with green ribbed foliage and showy white clusters of flowers in the spring. In the fall months, its peeling bark and orange-yellow leaves provide seasonal interest. A very compact shrub, Bircheaf spirea can grow up to 90 cm tall and forms a mounding shape. Birchleaf spirea prefers full sun to part shade and moist, well-drained soils. This is a great, tidy little shrub perfect for small yards and gardens.\n\nWhen selecting non-invasive plants for your garden, be sure to look for those that are suitable for your location, including moisture requirements, hardiness zone, and avoidance of known bear attractants among other factors.",
        "image_links": [
            "https://bcinvasives.ca/wp-content/uploads/2021/05/Birchleaf-spirea-002_Spiraea-betulifolia_D-Powell_USDA-Forest-Service_Bugwood.org_-1170x780.jpg"
        ]
    },
    {
        "species_id": "bdf5453d-14e9-4ba0-a16c-3ff7e02ffaca",
        "scientific_name": [
            "spiraea_douglasii"
        ],
        "common_name": [
            "steeple-bush"
        ],
        "resource_links": [
            "https://en.wikipedia.org/wiki/spiraea%20douglasii"
        ],
        "species_description": "Spiraea douglasii is a species of flowering plant in the rose family native to western North America. Common names include hardhack, hardhack steeplebush, Douglas' spirea, douglasspirea, steeplebush, and rose spirea.",
        "image_links": [
            "https://upload.wikimedia.org/wikipedia/commons/thumb/6/65/Spiraea_douglasii_01.jpg/220px-Spiraea_douglasii_01.jpg"
        ]
    },
    {
        "species_id": "ada7769e-0699-4bf0-852f-d196aa35f795",
        "scientific_name": [
            "stachys_byzantina"
        ],
        "common_name": [
            "Lamb's-ear"
        ],
        "resource_links": [
            "https://en.wikipedia.org/wiki/stachys%20byzantina"
        ],
        "species_description": "Stachys byzantina (syn. S. lanata), the lamb's-ear (lamb's ear) or woolly hedgenettle, is a species of flowering plant in the mint family Lamiaceae, native to Armenia, Iran, and Turkey. It is cultivated throughout much of the temperate world as an ornamental plant, and is naturalised in some locations as an escapee from gardens. Plants are very often found under the synonym Stachys lanata or Stachys olympica.Lamb's-ear flowers in late spring and early summer; plants produce tall spike-like stems with a few reduced leaves. The flowers are small and light purple. The plants tend to be evergreen but can \"die back” during cold winters and regenerate new growth from the crowns.",
        "image_links": [
            "https://upload.wikimedia.org/wikipedia/commons/thumb/5/59/0_Stachys_byzantina_-_Yvoire_%282%29.JPG/220px-0_Stachys_byzantina_-_Yvoire_%282%29.JPG"
        ]
    },
    {
        "species_id": "992a4068-03d8-4415-a160-7b58f70a75c6",
        "scientific_name": [
            "syringa_meyeri"
        ],
        "common_name": [
            "downy_lilac",
            "hairy_lilac",
            "korean_lilac",
            "meyer_lilac"
        ],
        "resource_links": [
            "https://en.wikipedia.org/wiki/syringa%20meyeri"
        ],
        "species_description": "Syringa pubescens is a species of flowering plant in the lilac genus of the family Oleaceae, native to Korea and China (Gansu, Hebei, Henan, Hubei, Jilin, Liaoning, Ningxia, Qinghai, Shaanxi, Shandong, Shanxi, Sichuan).Growing to 6 m (20 ft) tall and broad, it is a substantial deciduous shrub with green leaves felted white beneath, and panicles of heavily scented, white-throated lilac flowers in early summer.The Latin specific epithet pubescens means \"downy\", referring to the texture of the leaves.Three subspecies (formerly listed as separate species) are recognized :The cultivar S. pubescens subsp. microphylla 'Superba' has gained the Royal Horticultural Society's Award of Garden Merit.According to some authorities Syringa meyeri C.K.Schneid. is a synonym of S. pubescens. The cultivar ‘Palibin’ has also won the AGM. However, the nearly palmate leaf venation of plants labelled S. meyeri is noticeably distinct from the pinnate venation of other forms of S. pubescens.",
        "image_links": [
            "https://upload.wikimedia.org/wikipedia/commons/thumb/8/86/Syringia_julianae0.jpg/220px-Syringia_julianae0.jpg"
        ]
    },
    {
        "species_id": "56dd6a6e-8e87-483c-b660-1c472b4bfa45",
        "scientific_name": [
            "syringa_x_prestoniae"
        ],
        "common_name": [
            "preston_lilac"
        ],
        "resource_links": [
            "https://bcinvasives.ca/play-your-part/plantwise/grow-me-instead/preston-lilac/"
        ],
        "species_description": "Preston lilac is a deciduous shrub popular for its extremely fragrant flowers. Blooming in the spring, Preston lilacs are available in several different flower colors ranging from pink, white, purple to red. Growing to 3.5 m tall, this is a very tough, low-maintenance shrub. As a bonus, pollinators love it!\n\nWhen selecting non-invasive plants for your garden, be sure to look for those that are suitable for your location, including moisture requirements, hardiness zone, and avoidance of known bear attractants among other factors.",
        "image_links": [
            "https://bcinvasives.ca/wp-content/uploads/2021/05/Preston-Lilac_Syringa-x-prestonae_Dow-Gardens_Bugwood.org_-800x533.jpg"
        ]
    },
    {
        "species_id": "a767f33d-bb10-4beb-9824-be1eef829b4c",
        "scientific_name": [
            "tolmiea_menziesii"
        ],
        "common_name": [
            "pick-a-back-plant",
            "youth-on-age"
        ],
        "resource_links": [
            "https://en.wikipedia.org/wiki/tolmiea%20menziesii"
        ],
        "species_description": "Tolmiea menziesii (/tɒlˈmiːə mɛnˈziːzi.aɪ/) is a species of flowering plant in the family Saxifragaceae. It is known by the common names youth on age, pick-a-back-plant, piggyback plant, and thousand mothers.\nIt is a perennial plant native to the West Coast of North America, occurring in northern California, Oregon, Washington, British Columbia and southern Alaska. It occurs as a naturalised plant or garden escapee in Scotland, parts of Wales, Northern Ireland and northern and western parts of England.: 120",
        "image_links": [
            "https://upload.wikimedia.org/wikipedia/commons/thumb/1/1a/Tolmiea_menziesii_-_Youth-on-Age.jpg/220px-Tolmiea_menziesii_-_Youth-on-Age.jpg"
        ]
    },
    {
        "species_id": "b188809f-3f09-4520-8cb9-fad14404e227",
        "scientific_name": [
            "vaccinium_ovatum"
        ],
        "common_name": [
            "California huckleberry",
            "evergreen blueberry",
            "evergreen huckleberry"
        ],
        "resource_links": [
            "https://en.wikipedia.org/wiki/vaccinium%20ovatum"
        ],
        "species_description": "Vaccinium ovatum is a North American species of flowering shrub known by the common names evergreen huckleberry, winter huckleberry, cynamoka berry and California huckleberry.",
        "image_links": [
            "https://upload.wikimedia.org/wikipedia/commons/thumb/7/77/Vacciniumovatum.jpg/220px-Vacciniumovatum.jpg",
            "https://upload.wikimedia.org/wikipedia/commons/thumb/2/23/Vaccinium_ovatum_%283438582162%29.jpg/220px-Vaccinium_ovatum_%283438582162%29.jpg"
        ]
    },
    {
        "species_id": "bc90f4b7-c1f9-4bbc-9247-bb1cff0222a2",
        "scientific_name": [
            "vallisneria_americana"
        ],
        "common_name": [
            "American eelgrass",
            "eel-grass",
            "watercelery"
        ],
        "resource_links": [
            "https://en.wikipedia.org/wiki/vallisneria%20americana"
        ],
        "species_description": "Vallisneria americana, commonly called wild celery, water-celery, tape grass, or  eelgrass,  is a plant in the family Hydrocharitaceae, the \"tape-grasses\". V. americana is a fresh water species that can tolerate salt, living in salinities  varying from fresh water (0 parts per thousand) to 18 parts per thousand, although the limit to the salt tolerance is unclear, and is generally dependent on the duration and intensity of the plants’ exposure to the saline water. V. americana is a deep rooted plant with leaves, approximately one inch wide, with the ability to rise two or more meters above the clustered base of the plant. Contrary to the implications of one of its common names, wild celery bears little to no resemblance to the celery used as a vegetable. V. americana grows under water and is consumed by various animals, including the canvasback. The plants themselves are long, limp, flat, and have a green mid-ridge.Despite its name, it is not restricted to the Americas. It occurs naturally in Iraq, China, Japan, Korea, India, Papua New Guinea, the Philippines, Australia, Canada, the United States, Mexico, Guatemala, Honduras, Cuba, the Dominican Republic, Haiti and Venezuela.  It is found primarily in eastern North America, occurring west from Nova Scotia to South Dakota and South to the Gulf of Mexico. It has also been reported in the western states of Washington, Nebraska, New Mexico and Arizona.V. americana is cultivated for the aquarium trade, where it is a sold as a background plant.",
        "image_links": [
            "https://upload.wikimedia.org/wikipedia/commons/thumb/0/00/Vallisneria_americana_UMFS_3.JPG/220px-Vallisneria_americana_UMFS_3.JPG"
        ]
    },
    {
        "species_id": "622d12d6-3b87-4bff-9f59-9b1d1c983be7",
        "scientific_name": [
            "verbena_hastata"
        ],
        "common_name": [
            "american_vervain"
        ],
        "resource_links": [
            "https://en.wikipedia.org/wiki/verbena%20hastata"
        ],
        "species_description": "Verbena hastata, commonly known as American vervain, blue vervain, simpler's joy, or swamp verbena, is a perennial flowering plant in the vervain family Verbenaceae. It grows throughout the continental United States and in much of southern Canada.",
        "image_links": [
            "https://upload.wikimedia.org/wikipedia/commons/thumb/7/79/Verbena_hastata.JPG/220px-Verbena_hastata.JPG"
        ]
    },
    {
        "species_id": "f43e4409-bd9c-4d0c-9503-2638ff3c8be0",
        "scientific_name": [
            "veronica_spicata"
        ],
        "common_name": [
            "spiked_speedwell"
        ],
        "resource_links": [
            "https://en.wikipedia.org/wiki/veronica%20spicata"
        ],
        "species_description": "Veronica spicata (spiked speedwell; syn. Pseudolysimachion spicatum) is a species of flowering plant in the family Plantaginaceae. It is 1–3 feet (0.30–0.91 m) tall and bears 1 foot long spikes with blue, pink, purple and white flowers.It is the county flower of Montgomeryshire in the United Kingdom. Cultivated varieties include blue ('Royal Candles'), red ('Red Fox') and white ('Noah Williams').It became a protected species in the UK in 1975 under the Conservation of Wild Creatures and Wild Plants Act.",
        "image_links": [
            "https://upload.wikimedia.org/wikipedia/commons/thumb/b/bb/Bombus_norvegicus_-_Veronica_spicata_-_Keila.jpg/220px-Bombus_norvegicus_-_Veronica_spicata_-_Keila.jpg"
        ]
    },
    {
        "species_id": "d6937be7-dfa7-478c-b179-998a62152db4",
        "scientific_name": [
            "viburnum_lantanoides"
        ],
        "common_name": [
            "american_wayfaring_tree",
            "alder-leaved_viburnum",
            "hobblebush",
            "witch_hobble"
        ],
        "resource_links": [
            "https://en.wikipedia.org/wiki/viburnum%20lantanoides"
        ],
        "species_description": "Viburnum lantanoides (commonly known as hobble-bush,  witch-hobble, alder-leaved viburnum, American wayfaring tree, and moosewood) is a perennial shrub of the family Adoxaceae (formerly in the Caprifoliaceae), growing 2–4 meters (6–12 ft) high with pendulous branches that take root where they touch the ground. These rooted branches form obstacles which easily trip (or hobble) walkers – hence the common name.The shrub forms large clusters of white to pink flowers in May–June. The flowers on the outer edge of the clusters are much larger (3–5 cm across). The whole cluster is typically 10 cm across. It has large, cardioid leaves which are serrate, 10–20 cm long.  The bark is gray-brown and warty and the fruit is a red drupe, which turns to black when ripe.The flowers provide nectar for the Celastrina ladon (Spring Azure) butterfly.  Mammals and birds feed on its fruit, twigs, and leaves.  The large showy flowers along the edge of the cluster are sterile, while the small inner flowers have both male and female parts.",
        "image_links": [
            "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b9/ON_-_Algonquin_Provincial_Park_-_Bl%C3%BCte.jpg/220px-ON_-_Algonquin_Provincial_Park_-_Bl%C3%BCte.jpg"
        ]
    },
    {
        "species_id": "f1a26d1b-158b-438f-9f49-f7701ba64348",
        "scientific_name": [
            "viburnum_lentago"
        ],
        "common_name": [
            "black_haw",
            "nannyberry",
            "sheepberry",
            "sweet_viburnum"
        ],
        "resource_links": [
            "https://en.wikipedia.org/wiki/viburnum%20lentago"
        ],
        "species_description": "Viburnum lentago, the nannyberry, sheepberry, or sweet viburnum, is a species of Viburnum native to North America.",
        "image_links": [
            "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a7/Viburnum_lentago_NRCS-006.jpg/220px-Viburnum_lentago_NRCS-006.jpg",
            "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f9/Viburnum_lentago_NRCS-005.jpg/220px-Viburnum_lentago_NRCS-005.jpg"
        ]
    },
    {
        "scientific_name": [
            "perovskia_atriplicifolia"
        ],
        "common_name": [
            "Russian-sage"
        ],
        "resource_links": [
            "https://en.wikipedia.org/wiki/perovskia%20atriplicifolia"
        ],
        "image_links": [
            "https://upload.wikimedia.org/wikipedia/commons/thumb/5/5d/Russian_sage_by_RO_IV.jpg/220px-Russian_sage_by_RO_IV.jpg"
        ],
        "species_description": "Salvia yangii, previously known as Perovskia atriplicifolia (/pəˈrɒvskiə ætrɪplɪsɪˈfoʊliə/), and commonly called Russian sage, is a flowering herbaceous perennial plant and subshrub. Although not previously a member of Salvia, the genus widely known as sage, since 2017 it has been included within them. It has an upright habit, typically reaching .mw-parser-output .frac{white-space:nowrap}.mw-parser-output .frac .num,.mw-parser-output .frac .den{font-size:80%;line-height:0;vertical-align:super}.mw-parser-output .frac .den{vertical-align:sub}.mw-parser-output .sr-only{border:0;clip:rect(0,0,0,0);clip-path:polygon(0px 0px,0px 0px,0px 0px);height:1px;margin:-1px;overflow:hidden;padding:0;position:absolute;width:1px}0.5–1.2 metres (1+1⁄2–4 feet) tall, with square stems and gray-green leaves that yield a distinctive odor when crushed. It is best known for its flowers. Its flowering season extends from mid-summer to late October, with blue to violet blossoms arranged into showy, branched panicles.It is native to the steppes and hills of southwestern and central Asia. Successful over a wide range of climate and soil conditions, it has since become popular and widely planted. Several cultivars have been developed, differing primarily in leaf shape and overall height; 'Blue Spire' is the most common. This variation has been widely used in gardens and landscaping. S. yangii was the Perennial Plant Association's 1995 Plant of the Year, and the 'Blue Spire' cultivar received the Award of Garden Merit from the Royal Horticultural Society.The species has a long history of use in traditional medicine in its native range, where it is employed as a treatment for a variety of ailments. This has led to the investigation of its phytochemistry. Its flowers can be eaten in salads or crushed for dyemaking, and the plant has been considered for potential use in the phytoremediation of contaminated soil."
    },
    {
        "scientific_name": [
            "iris_sibirica"
        ],
        "common_name": [
            "Siberian iris",
            "Siberian flag"
        ],
        "resource_links": [
            "https://en.wikipedia.org/wiki/Iris_sibirica"
        ],
        "image_links": [
            "https://upload.wikimedia.org/wikipedia/commons/e/e5/Sibirische_Schwertlilie%2C_Iris_sibirica_06.JPG"
        ],
        "species_description": "Iris sibirica, commonly known as Siberian iris or Siberian flag, is a species of flowering plant in the family Iridaceae. It is a rhizomatous herbaceous perennial, from Europe (including France, Italy, Switzerland, Austria, Czech Republic, Slovakia, Germany, Hungary, Poland, Romania, Bulgaria, Former Yugoslavia, Belarus, Estonia, Latvia, Lithuania, Moldova, Ukraine and northern Turkey) and Central Asia (including Armenia, Azerbaijan and Siberia). It has long green grass-like leaves, tall stem, 2–5 violet-blue, to blue, and occasionally white flowers. It is cultivated as an ornamental plant in temperate regions."
    },
    {
        "scientific_name": [
            "amelanchier_arborea"
        ],
        "common_name": [
            "Allegheny Serviceberry",
            "Apple Shadbush",
            "Common Serviceberry",
            "Downy Juneberry",
            "Downy Serviceberry",
            "Downy Shadbush",
            "Juneberry",
            "Shadblow"
        ],
        "resource_links": [
            "https://en.wikipedia.org/wiki/amelanchier%20arborea"
        ],
        "image_links": [
            "https://upload.wikimedia.org/wikipedia/commons/thumb/3/34/Amelanchier_arborea_leaves.JPG/220px-Amelanchier_arborea_leaves.JPG",
            "https://upload.wikimedia.org/wikipedia/commons/thumb/5/50/Status_TNC_G5.svg/220px-Status_TNC_G5.svg.png",
            "https://upload.wikimedia.org/wikipedia/commons/thumb/3/3f/Amelanchier_arborea_range_map_1.png/220px-Amelanchier_arborea_range_map_1.png"
        ],
        "species_description": "Amelanchier arborea (downy serviceberry or common serviceberry), is native to eastern North America from the Gulf Coast north to Thunder Bay in Ontario and Lake St. John in Quebec, and west to Texas and Minnesota.Other common names are \"shadberries\" (as their blossoming coincides with the shad runs in New England), \"Juneberries\" (because the berries usually set on in June), and \"Service\" or \"Sarvice\" berries because their blooms mean that the muddy back roads into the \"coves and hollers\" of Appalachia will soon be passable for circuit-riding preachers and the communities will be able to have Sunday services again. (Some say, more morbidly, that it means the ground is soft enough to dig, which means that those who died over winter can be buried and have services said over them.)Amelanchier arborea is generally 5–12 m (16–39 ft) tall. Occasionally, it can grow up to 20 metres (66 ft) tall and reach into the overstory. The trunk can be up to 15 cm (6 in) in diameter (rarely to 40 cm or 16 in). The bark is smooth and gray.The buds are slender with a pointed tip, and usually more than two scales visible. The leaves are ovate or elliptical, .mw-parser-output .frac{white-space:nowrap}.mw-parser-output .frac .num,.mw-parser-output .frac .den{font-size:80%;line-height:0;vertical-align:super}.mw-parser-output .frac .den{vertical-align:sub}.mw-parser-output .sr-only{border:0;clip:rect(0,0,0,0);clip-path:polygon(0px 0px,0px 0px,0px 0px);height:1px;margin:-1px;overflow:hidden;padding:0;position:absolute;width:1px}4–8 cm (1+1⁄2–3+1⁄4 in), rarely 10 cm (4 in), long and 2.5–4 cm (1–1+5⁄8 in) wide, with pointed tips and finely serrated margins. A characteristic useful for identification is that the young leaves emerge downy on the underside. The fall color is variable, from orange-yellow to pinkish or reddish.It has perfect flowers that are 15–25 mm (5⁄8–1 in) in diameter, with 5 petals, emerging during budbreak in early spring. The petals are white. Flowers are produced on pendulous racemes 3–5 cm (1+1⁄4–2 in) long with 4–10 flowers on each raceme. The flowers are pollinated by bees. The fruit is a reddish-purple pome, resembling a small apple in shape. They ripen in summer and are very popular with birds. The fruit is eaten by over 40 species of birds and various mammals, including squirrels, rabbits, chipmunks, mice, voles, foxes,  black bears, deer, and elk.It also commonly hybridizes with other species of Amelanchier, the hybrid Amelanchier × grandiflora being one example, and identification can be very difficult as a result."
    },
    {
        "scientific_name": [
            "aconitum_spp."
        ],
        "common_name": [
            "Aconite",
            "Monkshood",
            "Wolfsbane",
            "Leopard's bane",
            "Devil's helmet",
            "Blue rocket"
        ],
        "resource_links": [
            "https://en.wikipedia.org/wiki/Aconitum"
        ],
        "image_links": [
            "https://upload.wikimedia.org/wikipedia/commons/f/ff/Aconitum_variegatum_110807f.jpg"
        ],
        "species_description": "Aconitum (/ˌækəˈnaɪtəm/), also known as aconite, monkshood, wolfsbane, leopard's bane, devil's helmet, or blue rocket, is a genus of over 250 species of flowering plants belonging to the family Ranunculaceae. These herbaceous perennial plants are chiefly native to the mountainous parts of the Northern Hemisphere in North America, Europe, and Asia; growing in the moisture-retentive but well-draining soils of mountain meadows."
    }
]