[
  {
    "scientificName": "Gypsophila oldhamiana",
    "speciesScore": 0.00533,
    "speciesOverview": "Gypsophila oldhamiana, the Manchurian baby's-breath or Oldham's baby's-breath, is a flowering plant of the family Caryophyllaceae.",
    "speciesDescription": "",
    "speciesImages": [],
    "isInvasive": false,
    "searchUrl": "https://en.wikipedia.org/w/index.php?search=Gypsophila%20oldhamiana"
  },
  {
    "scientificName": "Psammophiliella",
    "speciesScore": 0.25131,
    "speciesOverview": "",
    "speciesDescription": "Psammophiliella muralis is an annual, with erect glabrous (non hairy) stems. It grows up to 30–40 cm (12–16 in) tall, with linear shaped leaves. It blooms between summer and fall, with pink or very occasionally white flowers, which are 3.5–6 cm (1.4–2.4 in) across. Later it has fruit capsules, which are ovoid or ellipsoid, inside are snail-shaped seeds.",
    "speciesImages": [],
    "isInvasive": false,
    "searchUrl": "https://en.wikipedia.org/w/index.php?search=Gypsophila%20muralis"
  },
  {
    "scientificName": "Gypsophila elegans",
    "speciesScore": 0.005,
    "speciesOverview": "Gypsophila elegans, the annual baby's-breath or showy baby's-breath, is an ornamental plant native to Asia and Europe.",
    "speciesDescription": "",
    "speciesImages": [],
    "isInvasive": false,
    "searchUrl": "https://en.wikipedia.org/w/index.php?search=Gypsophila%20elegans"
  },
  {
    "scientificName": "Rhodanthe manglesii",
    "speciesScore": 0.00134,
    "speciesOverview": "Rhodanthe manglesii is a herbaceous plant, a native of Western Australia, that was introduced and cultivated in England in 1834 from seeds collected by James Mangles. Common names for this daisy include pink sunray, silver bells, Australian strawflower, timeless rose or Mangles everlasting.",
    "speciesDescription": "",
    "speciesImages": [],
    "isInvasive": false,
    "searchUrl": "https://en.wikipedia.org/w/index.php?search=Rhodanthe%20manglesii"
  },
  {
    "scientificName": "Spiraea prunifolia",
    "speciesScore": 0.01093,
    "speciesOverview": "Spiraea prunifolia, commonly called bridalwreath spirea, is a species of the genus Spiraea, sometimes also spelled Spirea. It flowers mid-spring, around May 5th, and is native to Japan, Korea, and China. It is sometimes cultivated as a garden plant elsewhere.",
    "speciesDescription": "",
    "speciesImages": [],
    "isInvasive": false,
    "searchUrl": "https://en.wikipedia.org/w/index.php?search=Spiraea%20prunifolia"
  },
  {
    "scientificName": "Euphorbia corollata",
    "speciesScore": 0.00544,
    "speciesOverview": "Euphorbia corollata is an herbaceous perennial plant in the family Euphorbiaceae that is native to North America. A common name for the species is flowering spurge. It has a milky sap that can cause skin and eye irritation in some people. It grows up to 1 m (3 ft) tall, with smooth stems and light green leaves arranged alternately or in whorls. Leaves are about 10 mm (1/2 in) wide and 75 mm (3 in) long. Each stem terminates in a panicle 20 to 25 mm (3/4 to 1 in) across. Flowers are about 6 mm (1/4 in) across and consist of one pistillate and several staminate flowers surrounded by five white bracts - not petals but formed from the involucre at the base of the flowers. Flowering spurge blooms from June to September.",
    "speciesDescription": "",
    "speciesImages": [],
    "isInvasive": false,
    "searchUrl": "https://en.wikipedia.org/w/index.php?search=Euphorbia%20corollata"
  },
  {
    "scientificName": "Sagina subulata",
    "speciesScore": 0.00112,
    "speciesOverview": "Sagina subulata ((syn. Sagina pilifera), the heath pearlwort, Irish-moss, awl-leaf pearlwort or Scottish moss, is a species of flowering plant in the pink and carnation family Caryophyllaceae. It is native to Europe, from Iceland south to Spain, and east to southern Sweden and Romania. It occurs on dry sandy or gravelly soils.",
    "speciesDescription": "Heath pearlwort is a low-growing prostrate perennial plant forming a thick, dense mat with stems less than 10 cm long, and slender subulate (awl-shaped) leaves up to 1 cm long. The flowers are 4–5 mm in diameter, with five white petals the same length as the green sepals; they are produced singly on erect stems 2–4 cm long. The seeds are smooth, brown, triangular shaped, 0.4–0.5 mm, produced in a capsule 2.5–3 mm long.",
    "speciesImages": [],
    "isInvasive": false,
    "searchUrl": "https://en.wikipedia.org/w/index.php?search=Sagina%20subulata"
  },
  {
    "scientificName": "Asperula tinctoria",
    "speciesScore": 0.00308,
    "speciesOverview": "Asperula tinctoria, common name dyer's woodruff, is a plant in the family Rubiaceae, a native of much of northern and central Europe from France to Russia and also of Western Siberia.",
    "speciesDescription": "",
    "speciesImages": [],
    "isInvasive": false,
    "searchUrl": "https://en.wikipedia.org/w/index.php?search=Asperula%20tinctoria"
  },
  {
    "scientificName": "Symphyotrichum pilosum",
    "speciesScore": 0.00127,
    "speciesOverview": "Symphyotrichum pilosum (formerly Aster pilosus) is a perennial, herbaceous, flowering plant in the Asteraceae family native to central and eastern North America. It is commonly called hairy white oldfield aster, frost aster, white heath aster, heath aster, hairy aster, common old field aster, old field aster, awl aster, nailrod, and steelweed. There are two varieties: Symphyotrichum pilosum var. pilosum, known by the common names previously listed, and Symphyotrichum pilosum var. pringlei, known as Pringle's aster. Both varieties are conservationally secure globally and in most provinces and states where they are native.",
    "speciesDescription": "Symphyotrichum pilosum is a perennial, herbaceous, flowering plant that reaches heights between 20 cm (8 in) and 120 cm (4 ft); some plants can be as short as 5 cm (2 in) and others up to or taller than 150 cm (5 ft). It flowers late summer to late fall, in the north ending in October and farther south in December. \n\nThere are two varieties: Symphyotrichum pilosum var. pilosum and S. pilosum var. pringlei. They differ in morphology, chromosome count, distribution, and habitat. S. pilosum var. pilosum is the autonym, with hairy stems and leaves. It is widespread and often weedy. S. pilosum var. pringlei is hairless, less common, and often grows in high-quality habitats.\n\nThe roots of S. pilosum have bulky and branched caudices that sometimes have long rhizomes which store nutrients for the next year's flowering. The plant is cespitose with one to five straight stems. The two varieties have different stem surfaces: S. pilosum var. pilosum has hairy stems (pilose to densely hirsute), and S. pilosum var. pringlei has stems with no hair (glabrous) or at most, they are hairy in vertical lines.\n\nS. pilosum has thin, alternate, and simple leaves. Those of S. pilosum var. pilosum are hairy, and those of S. pilosum var. pringlei are hairless or nearly hairless. Leaves grow at the base, on the stem, and in the inflorescence branches. The ground leaves (basal leaves) are either sessile or have very short leafstalks with sheathing wings fringed with hairs on the margins (edges), meaning they are ciliate. They are oblanceolate or obovate to spatulate with obtuse to rounded tips, and their bases are attenuate. Their margins are slightly wavy or saw-toothed, mostly near the tips. Basal leaves range in lengths from 10 to 60 mm (0.4 to 2 in) and widths from 5 to 15 mm (0.2 to 0.6 in). They grow in a rosette and develop prior to flowering, then wither or die during plant growth. At the time of flowering, another rosette of basal leaves forms.\n\nLower stem leaves usually wither by flowering, and they often have small leaves in clusters at the stem nodes. These stem leaves are entire (smooth on the margins) to saw-toothed and have soft cilia. Their tips are attenuate, and the leaves are elliptic-oblanceolate, elliptic-oblong, linear-lanceolate, or linear-oblanceolate. The leaf bases can be petiolate or subpetiolate to subsessile, and they clasp the stem with attenuate to cuneate bases with wings. Lengths are from 40 to 102 mm (1.6 to 4.0 in) and widths from 5 to 25 mm (0.2 to 1 in), getting progressively smaller as they approach the upper portion of the stem.\n\nDistal leaves, higher on the stem and on the branches with the flower heads, are lance-oblong, linear-lanceolate, linear, linear-oblanceolate, or linear-subulate. Their margins are entire or saw-toothed, and they are sessile with cuneate bases. Lengths range from 10 to 100 mm (0.4 to 4 in) and widths are  1 to 8 mm (0.04 to 0.3 in). The leaves get progressively smaller near the inflorescences; closest to the flower heads, their sizes are abruptly reduced.\n\nThe flower heads of Symphyotrichum pilosum are 13 to 19 mm (0.5 to 0.75 in) wide and grow on branches that are 100 mm (4 in) or less at wide angles off the stem (divaricate). They also may be ascending and arching. They are open, generally not crowded, and have many small leaves. Each flower head is on a peduncle that is usually 5 to 30 mm (0.20 to 1.2 in), sometimes as long as 50 mm (2 in). They get shorter the farther up the branch they grow which then causes the inflorescence to look like a pyramid. The peduncles of S. pilosum var. pilosum have dense and bristly hairs (hispid), and those of S. p. var. pringlei are hairless (glabrous). Both varieties have from 7 to 25 or more bracts that are glabrous and may have cilia.\n\nFlower heads of all members of the Asteraceae family have phyllaries which are small, specialized leaves that look like scales. Together they form the involucre that protects the individual flowers in the head before they open. The involucres of Symphyotrichum pilosum are campanulate to cylindro-campanulate in shape (bell to cylinder-bell) and usually 3.5 to 5.1 mm (0.14 to 0.20 in) in length, although they can be as short as 2.5 mm (0.1 in) and as long as 6.5 mm (0.26 in).\n\nThe phyllaries of S. pilosum var. pilosum have small and sparse hairs, meaning they are hirsutulous, and those of variety pringlei are glabrous. Both varieties have phyllaries in 4 to 6 rows that are unequally aligned, and rarely subequally aligned. The phyllaries are appressed or slightly spreading, and the outer ones are oblong-lanceolate in shape, while the inner are linear. They have green chlorophyllous zones that are lanceolate to lance-rhombic with apices (tips) that have either short and sharp points (acute) or taper to long points (acuminate). Their margins appear white or light green, but they are actually translucent and may appear nibbled or worn away (in botanical terms, they are scarious and erose). They are inrolled at the tips.\n\nEach flower head is made up of ray florets and disk florets. The 16 to 28 ray florets grow in one series and are usually white, rarely pinkish or bluish. They are usually between 5.4 and 7.5 mm (0.21 and 0.30 in) in length, but can be as short as 4 mm (0.16 in) and as long as 11 mm (0.43 in). They are 0.4 to 1.7 mm (0.016 to 0.067 in) wide and they make up about 45% of the total number of florets on a flower head.\n\nThe disks have 17 to 39 florets that start out as yellow and after opening, turn reddish purple or brown after pollination. Each disk floret is 3.4 to 4.1 mm (0.13 to 0.16 in) in depth, sometimes up to 5.5 mm (0.22 in), and is made up of 5 petals, collectively a corolla, which open into 5 lanceolate lobes comprising 0.4 to 1 mm (0.02 to 0.04 in) of the depth of the floret.\n\nThe fruits of Symphyotrichum pilosum are not true achenes but are cypselae, resembling an achene and surrounded by a calyx sheath. This is true for all members of the Asteraceae family. After pollination, they become off-white or gray with an oblong-obovoid shape, 1 to 1.5 mm (0.04 to 0.06 in) in length, and 0.5 to 0.7 mm (0.02 to 0.03 in) in width. They have 4 to 6 nerves and a few stiff, slender bristles on their surfaces (strigillose). Their pappi (tufts of hairs) are white and 3.5 to 4 mm (0.14 to 0.16 in) in length. The seeds mature late in the season but cannot germinate at low temperatures. They are dispersed by the fall and winter winds and germinate when temperatures become warm in the spring.\n\nS. pilosum has a monoploid number (also called base number) of eight chromosomes (x = 8). There are plants of S. pilosum var. pilosum with four and six sets of the chromosomes, tetraploid with 32 total and hexaploid with 48 total, respectively. These cytotypes occur regularly, with occasional pentaploids (five sets) that have 40 in total. S. pilosum var. pringlei is hexaploid with a total chromosome count of 48.\n\nDifferences in morphology have been found between tetraploids and hexaploids of S. pilosum var. pilosum in southwestern Ontario, including involucre and floret sizes, branch length, leaf sizes, and others; they are consistently smaller on tetraploids than on hexaploids. Additionally, the leaf hair on tetraploids is denser than on hexaploids.",
    "speciesImages": [
      "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d3/Symphyotrichum_pilosum_173527177.jpg/180px-Symphyotrichum_pilosum_173527177.jpg",
      "https://upload.wikimedia.org/wikipedia/commons/thumb/0/0f/Symphyotrichum_pilosum_pilosum_226310223.jpg/180px-Symphyotrichum_pilosum_pilosum_226310223.jpg",
      "https://upload.wikimedia.org/wikipedia/commons/thumb/1/19/Symphyotrichum_pilosum_kidatikngk16_%28cropped%29.jpg/180px-Symphyotrichum_pilosum_kidatikngk16_%28cropped%29.jpg",
      "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c3/Aster_pilosus_holotype_BW15857010.jpg/276px-Aster_pilosus_holotype_BW15857010.jpg",
      "https://upload.wikimedia.org/wikipedia/commons/thumb/9/99/Aster_ericoides_var._pringlei_holotype_NMNH-00145617.jpg/319px-Aster_ericoides_var._pringlei_holotype_NMNH-00145617.jpg",
      "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8d/Symphyotrichum_pilosum_pilosum_native_distribution.png/200px-Symphyotrichum_pilosum_pilosum_native_distribution.png",
      "https://upload.wikimedia.org/wikipedia/commons/thumb/3/34/Symphyotrichum_pilosum_pringlei_native_distribution.png/200px-Symphyotrichum_pilosum_pringlei_native_distribution.png"
    ],
    "isInvasive": false,
    "searchUrl": "https://en.wikipedia.org/w/index.php?search=Symphyotrichum%20pilosum"
  },
  {
    "scientificName": "Lonas",
    "speciesScore": 0.00268,
    "speciesOverview": "",
    "speciesDescription": "",
    "speciesImages": [],
    "isInvasive": false,
    "searchUrl": "https://en.wikipedia.org/w/index.php?search=Lonas%20annua"
  },
  {
    "scientificName": "Cerastium biebersteinii",
    "speciesScore": 0.00365,
    "speciesOverview": "Cerastium biebersteinii, the boreal chickweed, is an ornamental plant in the genus Cerastium and the family Caryophyllaceae. It is an endemic of the Crimea. The species is named after a German botanist Friedrich August Marschall von Bieberstein.",
    "speciesDescription": "The plant is perennial and herbaceous. The stem is 15–25 centimeters high.\n\nThe leaves are whitish and tomentose, flat or linear prolonged, a bit acute, smooth-edged 0,2–3 centimeters long and 1–9 millimeters wide.\n\nThe flowers are white, 1,5–2,2 centimeters in diameter, situated in cymes on top of the sprout. Blooming period is from the end of April to the end of May.",
    "speciesImages": [],
    "isInvasive": false,
    "searchUrl": "https://en.wikipedia.org/w/index.php?search=Cerastium%20biebersteinii"
  },
  {
    "scientificName": "Gypsophila paniculata",
    "speciesScore": 0.00193,
    "speciesOverview": "Gypsophila paniculata, the baby's breath, common gypsophila or panicled baby's-breath, is a species of flowering plant in the family Caryophyllaceae, native to central and eastern Europe. It is an herbaceous perennial growing to 1.2 m (4 ft) tall and wide, with mounds of branching stems covered in clouds of tiny white flowers in summer (hence the common name \"baby's breath\"). Another possible source of this name is its scent, which has been described as sour milk, like a baby’s “spit-up”. Its natural habitat is on the Steppes in dry, sandy and stony places, often on calcareous soils (gypsophila = \"chalk-loving\"). Specimens of this plant were first sent to Linnaeus from St. Petersburg by the Swiss-Russian botanist Johann Amman.",
    "speciesDescription": "",
    "speciesImages": [
      "https://upload.wikimedia.org/wikipedia/commons/thumb/9/9f/Close-up_of_2_baby%27s_breath_%28Gypsophila_paniculata%29_flowers.jpg/96px-Close-up_of_2_baby%27s_breath_%28Gypsophila_paniculata%29_flowers.jpg",
      "https://upload.wikimedia.org/wikipedia/commons/thumb/4/46/Schleierkraut_und_rote_Rose.jpg/97px-Schleierkraut_und_rote_Rose.jpg",
      "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8d/Illustration_Gypsophila_paniculata0.jpg/71px-Illustration_Gypsophila_paniculata0.jpg"
    ],
    "isInvasive": true,
    "searchUrl": "https://en.wikipedia.org/w/index.php?search=Gypsophila%20paniculata"
  },
  {
    "scientificName": "Delphinium grandiflorum",
    "speciesScore": 0.00134,
    "speciesOverview": "Delphinium grandiflorum is a species of Delphinium known by the common names Siberian larkspur and Chinese Delphinium. It is native to Russia and China. There are several popular cultivars in several colours which are grown as ornamental plants, including 'Blue Butterfly', 'Summer Morning', 'Blue Mirror', and 'Summer Stars'. Like many other larkspurs, this plant is poisonous. It is much shorter and more compact than the more familiar tall D. elatum, with dispersed flowers, rather than single spikes.",
    "speciesDescription": "",
    "speciesImages": [],
    "isInvasive": false,
    "searchUrl": "https://en.wikipedia.org/w/index.php?search=Delphinium%20grandiflorum"
  },
  {
    "scientificName": "Eudianthe coeli-rosa",
    "speciesScore": 0.00156,
    "speciesOverview": "",
    "speciesDescription": "",
    "speciesImages": [],
    "isInvasive": false,
    "searchUrl": "https://en.wikipedia.org/w/index.php?search=Silene%20coeli-rosa"
  },
  {
    "scientificName": "Search results",
    "speciesScore": 0.0021,
    "speciesOverview": "",
    "speciesDescription": "",
    "speciesImages": [],
    "isInvasive": false,
    "searchUrl": "https://en.wikipedia.org/w/index.php?search=Arabis%20scopoliana"
  },
  {
    "scientificName": "Search results",
    "speciesScore": 0.00172,
    "speciesOverview": "",
    "speciesDescription": "",
    "speciesImages": [],
    "isInvasive": false,
    "searchUrl": "https://en.wikipedia.org/w/index.php?search=Jamesbrittenia%20grandiflora"
  },
  {
    "scientificName": "Achillea alpina",
    "speciesScore": 0.00102,
    "speciesOverview": "Achillea alpina, commonly known as alpine yarrow, Chinese yarrow or Siberian yarrow, is an Asian and North American species of plant in the sunflower family. It is native to Siberia, the Russian Far East, China, Mongolia, Korea, Japan, Nepal, Canada (including Yukon and Northwest Territories), the northern United States (Alaska, northern North Dakota, northern Minnesota).",
    "speciesDescription": "Achillea alpina is a perennial herb up to 80 cm (2 feet) tall. Flowers are white to pale violet, with both ray florets and disc florets. The foliage is simply pinnatifid with narrow closely set segments.\n\nThis species is found growing in thickets and along shorelines in northwestern North America and it reaches its most southernly distribution in northern Minnesota near the Canadian border where isolated populations are found growing in a peat meadows at the margins of aspen trees, open woods, woodland edges, stream banks, and roadsides. In Minnesota it was listed as a threatened species in 1996.",
    "speciesImages": [],
    "isInvasive": false,
    "searchUrl": "https://en.wikipedia.org/w/index.php?search=Achillea%20alpina"
  },
  {
    "scientificName": "Symphyotrichum dumosum",
    "speciesScore": 0.0017,
    "speciesOverview": "Symphyotrichum dumosum (formerly Aster dumosus) is a species of flowering plant of the family Asteraceae commonly known as rice button aster and bushy aster. It is native to much of eastern and central North America, as well as Haiti and Dominican Republic. It is a perennial, herbaceous plant that may reach a height of 1 meter (3 feet 3 inches).",
    "speciesDescription": "Symphyotrichum dumosum is a perennial, herbaceous plant that grows up to 1 meter (3 feet 3 inches) high.\n\nSymphyotrichum dumosum is a late-summer and fall blooming perennial, with flower heads opening August–October. The flower heads are about .mw-parser-output .frac{white-space:nowrap}.mw-parser-output .frac .num,.mw-parser-output .frac .den{font-size:80%;line-height:0;vertical-align:super}.mw-parser-output .frac .den{vertical-align:sub}.mw-parser-output .sr-only{border:0;clip:rect(0,0,0,0);clip-path:polygon(0px 0px,0px 0px,0px 0px);height:1px;margin:-1px;overflow:hidden;padding:0;position:absolute;width:1px}13 millimeters (1⁄2 inch) diameter when in bloom and grow in open and much-branched paniculiform arrays. Each has many tiny florets put together into what appear as one.\n\nOn the outside the flower heads of all members of the family Asteraceae are small bracts that look like scales. These are called phyllaries, and together they form the involucre that protects the individual flowers in the head before they open. The involucres of Symphyotrichum dumosum are cylinder-bell in shape and usually 4.5–6.3 mm (1⁄5–1⁄4 in) long.\n\nThe phyllaries are appressed or slightly spreading. The shape of the outer phyllaries is oblong-oblanceolate or linear-oblanceolate, and the innermost phyllaries are linear. They are in 4–6 strongly unequal rows, meaning they are very staggered and do not end at the same point, and they are hairless.\n\nThe 15–33 ray florets are blue, pink, purple, or white, with a length averaging 5–7 mm (1⁄5–3⁄10 in) and width of 1–1.7 mm (1⁄24–1⁄16 in). Ray florets in the Symphyotrichum genus are exclusively female, each having a pistil (with style, stigma, and ovary) but no stamen; thus, ray florets accept pollen and each can develop a seed, but they produce no pollen.\n\nThe 15–30 disk florets start out as pale yellow and turn pink with age. They are in the shape of a narrow funnel and are shallow at 3.5–4.5 mm (3⁄20–1⁄5 in) in depth. The disk florets are each made up of 5 petals, collectively a corolla, which open into 5 lanceolate lobes comprising less than 25% of the depth of the floret. Disk florets in the Symphyotrichum genus are bisexual, each with both male (stamen, anthers, and filaments) and female reproductive parts; thus, a disk floret produces pollen and can develop a seed.\n\nSymphyotrichum dumosum has a chromosome number of x = 8. Diploid and tetraploid cytotypes with respective chromosome counts of 16 and 32 have been reported.",
    "speciesImages": [
      "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4b/Rice_button_aster_%28Symphyotrichum_dumosum%29_%286435495559%29.jpg/270px-Rice_button_aster_%28Symphyotrichum_dumosum%29_%286435495559%29.jpg",
      "https://upload.wikimedia.org/wikipedia/commons/thumb/1/1b/Symphyotrichum_dumosum_107676031.jpg/152px-Symphyotrichum_dumosum_107676031.jpg",
      "https://upload.wikimedia.org/wikipedia/commons/thumb/0/0f/Symphyotrichum_dumosum_108257760.jpg/202px-Symphyotrichum_dumosum_108257760.jpg",
      "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b4/Mason_Wasp_on_Bushy_Aster_%285250200700%29.jpg/210px-Mason_Wasp_on_Bushy_Aster_%285250200700%29.jpg",
      "https://upload.wikimedia.org/wikipedia/commons/thumb/0/0b/Symphyotrichum_dumosum_107676048.jpg/118px-Symphyotrichum_dumosum_107676048.jpg",
      "https://upload.wikimedia.org/wikipedia/commons/thumb/9/9e/Honey_Bee_on_Symphyotrichum_dumosum_%286435501395%29.jpg/210px-Honey_Bee_on_Symphyotrichum_dumosum_%286435501395%29.jpg",
      "https://upload.wikimedia.org/wikipedia/commons/thumb/3/37/Symphyotrichum_dumosum_105499607.jpg/315px-Symphyotrichum_dumosum_105499607.jpg"
    ],
    "isInvasive": false,
    "searchUrl": "https://en.wikipedia.org/w/index.php?search=Symphyotrichum%20dumosum"
  },
  {
    "scientificName": "Search results",
    "speciesScore": 0.00239,
    "speciesOverview": "",
    "speciesDescription": "",
    "speciesImages": [],
    "isInvasive": false,
    "searchUrl": "https://en.wikipedia.org/w/index.php?search=Consolida%20orientalis"
  },
  {
    "scientificName": "Search results",
    "speciesScore": 0.00101,
    "speciesOverview": "",
    "speciesDescription": "",
    "speciesImages": [],
    "isInvasive": false,
    "searchUrl": "https://en.wikipedia.org/w/index.php?search=Poranopsis%20paniculata"
  }
]
